;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
;* Date/Time created: Mon Nov 30 20:39:15 2015                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../aic3204_loop_linein.c")

	.dwattr $C$DW$T$190, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$190, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$190, DW_AT_decl_column(0x24)
$C$DW$T$191	.dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$191, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdlib.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x1a)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$192	.dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
	.dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$192, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x0e)
$C$DW$T$193	.dwtag  DW_TAG_typedef, DW_AT_name("Int32")
	.dwattr $C$DW$T$193, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$193, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$193, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$193, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$193, DW_AT_decl_column(0x0f)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x17)
$C$DW$T$194	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Xio")
	.dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$194, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$194, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$194, DW_AT_decl_column(0x13)
$C$DW$T$195	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_BitMask32")
	.dwattr $C$DW$T$195, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$195, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$195, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$195, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$195, DW_AT_decl_column(0x13)
$C$DW$217	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$217, DW_AT_type(*$C$DW$T$137)
$C$DW$T$196	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$196, DW_AT_type(*$C$DW$217)
$C$DW$T$197	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Reg32")
	.dwattr $C$DW$T$197, DW_AT_type(*$C$DW$T$196)
	.dwattr $C$DW$T$197, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$197, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$197, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$197, DW_AT_decl_column(0x1c)
$C$DW$T$198	.dwtag  DW_TAG_typedef, DW_AT_name("DWORD")
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$198, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$198, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$198, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$198, DW_AT_decl_column(0x14)
$C$DW$T$199	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$137)
	.dwattr $C$DW$T$199, DW_AT_address_class(0x17)
$C$DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("PDWORD")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$199)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x14)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
$C$DW$T$201	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_Uint64")
	.dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$201, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\csl_types.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x24)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x02)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("Queue")
	.dwattr $C$DW$T$21, DW_AT_byte_size(0x67)
$C$DW$218	.dwtag  DW_TAG_member
	.dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$218, DW_AT_name("head")
	.dwattr $C$DW$218, DW_AT_TI_symbol_name("_head")
	.dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$218, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$218, DW_AT_decl_line(0x13)
	.dwattr $C$DW$218, DW_AT_decl_column(0x08)
$C$DW$219	.dwtag  DW_TAG_member
	.dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$219, DW_AT_name("tail")
	.dwattr $C$DW$219, DW_AT_TI_symbol_name("_tail")
	.dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$219, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$219, DW_AT_decl_line(0x14)
	.dwattr $C$DW$219, DW_AT_decl_column(0x08)
$C$DW$220	.dwtag  DW_TAG_member
	.dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$220, DW_AT_name("count")
	.dwattr $C$DW$220, DW_AT_TI_symbol_name("_count")
	.dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$220, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$220, DW_AT_decl_line(0x15)
	.dwattr $C$DW$220, DW_AT_decl_column(0x08)
$C$DW$221	.dwtag  DW_TAG_member
	.dwattr $C$DW$221, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$221, DW_AT_name("Q")
	.dwattr $C$DW$221, DW_AT_TI_symbol_name("_Q")
	.dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$221, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$221, DW_AT_decl_line(0x16)
	.dwattr $C$DW$221, DW_AT_decl_column(0x08)
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x12)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$145	.dwtag  DW_TAG_typedef, DW_AT_name("Queue")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file("..\queue.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x17)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x03)
$C$DW$T$146	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$145)
	.dwattr $C$DW$T$146, DW_AT_address_class(0x17)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
$C$DW$222	.dwtag  DW_TAG_member
	.dwattr $C$DW$222, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$222, DW_AT_name("fd")
	.dwattr $C$DW$222, DW_AT_TI_symbol_name("_fd")
	.dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$222, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$222, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$222, DW_AT_decl_column(0x0b)
$C$DW$223	.dwtag  DW_TAG_member
	.dwattr $C$DW$223, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$223, DW_AT_name("buf")
	.dwattr $C$DW$223, DW_AT_TI_symbol_name("_buf")
	.dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$223, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$223, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$223, DW_AT_decl_column(0x16)
$C$DW$224	.dwtag  DW_TAG_member
	.dwattr $C$DW$224, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$224, DW_AT_name("pos")
	.dwattr $C$DW$224, DW_AT_TI_symbol_name("_pos")
	.dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$224, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$224, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$224, DW_AT_decl_column(0x16)
$C$DW$225	.dwtag  DW_TAG_member
	.dwattr $C$DW$225, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$225, DW_AT_name("bufend")
	.dwattr $C$DW$225, DW_AT_TI_symbol_name("_bufend")
	.dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$225, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$225, DW_AT_decl_line(0x20)
	.dwattr $C$DW$225, DW_AT_decl_column(0x16)
$C$DW$226	.dwtag  DW_TAG_member
	.dwattr $C$DW$226, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$226, DW_AT_name("buff_stop")
	.dwattr $C$DW$226, DW_AT_TI_symbol_name("_buff_stop")
	.dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$226, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$226, DW_AT_decl_line(0x21)
	.dwattr $C$DW$226, DW_AT_decl_column(0x16)
$C$DW$227	.dwtag  DW_TAG_member
	.dwattr $C$DW$227, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$227, DW_AT_name("flags")
	.dwattr $C$DW$227, DW_AT_TI_symbol_name("_flags")
	.dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$227, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$227, DW_AT_decl_line(0x22)
	.dwattr $C$DW$227, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
$C$DW$T$206	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$206, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$206, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$206, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$206, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$206, DW_AT_decl_column(0x03)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x48)
$C$DW$228	.dwtag  DW_TAG_member
	.dwattr $C$DW$228, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$228, DW_AT_name("EBSR")
	.dwattr $C$DW$228, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$228, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$228, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$228, DW_AT_decl_column(0x15)
$C$DW$229	.dwtag  DW_TAG_member
	.dwattr $C$DW$229, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$229, DW_AT_name("RSVD0")
	.dwattr $C$DW$229, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$229, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$229, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$229, DW_AT_decl_column(0x15)
$C$DW$230	.dwtag  DW_TAG_member
	.dwattr $C$DW$230, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$230, DW_AT_name("PCGCR1")
	.dwattr $C$DW$230, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$230, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$230, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$230, DW_AT_decl_column(0x15)
$C$DW$231	.dwtag  DW_TAG_member
	.dwattr $C$DW$231, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$231, DW_AT_name("PCGCR2")
	.dwattr $C$DW$231, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$231, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$231, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$231, DW_AT_decl_column(0x15)
$C$DW$232	.dwtag  DW_TAG_member
	.dwattr $C$DW$232, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$232, DW_AT_name("PSRCR")
	.dwattr $C$DW$232, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$232, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$232, DW_AT_decl_line(0x20)
	.dwattr $C$DW$232, DW_AT_decl_column(0x15)
$C$DW$233	.dwtag  DW_TAG_member
	.dwattr $C$DW$233, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$233, DW_AT_name("PRCR")
	.dwattr $C$DW$233, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$233, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$233, DW_AT_decl_line(0x21)
	.dwattr $C$DW$233, DW_AT_decl_column(0x15)
$C$DW$234	.dwtag  DW_TAG_member
	.dwattr $C$DW$234, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$234, DW_AT_name("RSVD1")
	.dwattr $C$DW$234, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$234, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$234, DW_AT_decl_line(0x22)
	.dwattr $C$DW$234, DW_AT_decl_column(0x15)
$C$DW$235	.dwtag  DW_TAG_member
	.dwattr $C$DW$235, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$235, DW_AT_name("TIAFR")
	.dwattr $C$DW$235, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$235, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$235, DW_AT_decl_line(0x23)
	.dwattr $C$DW$235, DW_AT_decl_column(0x15)
$C$DW$236	.dwtag  DW_TAG_member
	.dwattr $C$DW$236, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$236, DW_AT_name("RSVD2")
	.dwattr $C$DW$236, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$236, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$236, DW_AT_decl_line(0x24)
	.dwattr $C$DW$236, DW_AT_decl_column(0x15)
$C$DW$237	.dwtag  DW_TAG_member
	.dwattr $C$DW$237, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$237, DW_AT_name("ODSCR")
	.dwattr $C$DW$237, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$237, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$237, DW_AT_decl_line(0x25)
	.dwattr $C$DW$237, DW_AT_decl_column(0x15)
$C$DW$238	.dwtag  DW_TAG_member
	.dwattr $C$DW$238, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$238, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$238, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$238, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$238, DW_AT_decl_line(0x26)
	.dwattr $C$DW$238, DW_AT_decl_column(0x15)
$C$DW$239	.dwtag  DW_TAG_member
	.dwattr $C$DW$239, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$239, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$239, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$239, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$239, DW_AT_decl_line(0x27)
	.dwattr $C$DW$239, DW_AT_decl_column(0x15)
$C$DW$240	.dwtag  DW_TAG_member
	.dwattr $C$DW$240, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$240, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$240, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$240, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$240, DW_AT_decl_line(0x28)
	.dwattr $C$DW$240, DW_AT_decl_column(0x15)
$C$DW$241	.dwtag  DW_TAG_member
	.dwattr $C$DW$241, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$241, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$241, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$241, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$241, DW_AT_decl_line(0x29)
	.dwattr $C$DW$241, DW_AT_decl_column(0x15)
$C$DW$242	.dwtag  DW_TAG_member
	.dwattr $C$DW$242, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$242, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$242, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$242, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$242, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$242, DW_AT_decl_column(0x15)
$C$DW$243	.dwtag  DW_TAG_member
	.dwattr $C$DW$243, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$243, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$243, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$243, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$243, DW_AT_decl_column(0x15)
$C$DW$244	.dwtag  DW_TAG_member
	.dwattr $C$DW$244, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$244, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$244, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$244, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$244, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$244, DW_AT_decl_column(0x15)
$C$DW$245	.dwtag  DW_TAG_member
	.dwattr $C$DW$245, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$245, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$245, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$245, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$245, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$245, DW_AT_decl_column(0x15)
$C$DW$246	.dwtag  DW_TAG_member
	.dwattr $C$DW$246, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$246, DW_AT_name("CCR2")
	.dwattr $C$DW$246, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$246, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$246, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$246, DW_AT_decl_column(0x15)
$C$DW$247	.dwtag  DW_TAG_member
	.dwattr $C$DW$247, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$247, DW_AT_name("CGCR1")
	.dwattr $C$DW$247, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$247, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$247, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$247, DW_AT_decl_column(0x15)
$C$DW$248	.dwtag  DW_TAG_member
	.dwattr $C$DW$248, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$248, DW_AT_name("CGICR")
	.dwattr $C$DW$248, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$248, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$248, DW_AT_decl_line(0x30)
	.dwattr $C$DW$248, DW_AT_decl_column(0x15)
$C$DW$249	.dwtag  DW_TAG_member
	.dwattr $C$DW$249, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$249, DW_AT_name("CGCR2")
	.dwattr $C$DW$249, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$249, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$249, DW_AT_decl_line(0x31)
	.dwattr $C$DW$249, DW_AT_decl_column(0x15)
$C$DW$250	.dwtag  DW_TAG_member
	.dwattr $C$DW$250, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$250, DW_AT_name("CGOCR")
	.dwattr $C$DW$250, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$250, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$250, DW_AT_decl_line(0x32)
	.dwattr $C$DW$250, DW_AT_decl_column(0x15)
$C$DW$251	.dwtag  DW_TAG_member
	.dwattr $C$DW$251, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$251, DW_AT_name("CCSSR")
	.dwattr $C$DW$251, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$251, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$251, DW_AT_decl_line(0x33)
	.dwattr $C$DW$251, DW_AT_decl_column(0x15)
$C$DW$252	.dwtag  DW_TAG_member
	.dwattr $C$DW$252, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$252, DW_AT_name("RSVD3")
	.dwattr $C$DW$252, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$252, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$252, DW_AT_decl_line(0x34)
	.dwattr $C$DW$252, DW_AT_decl_column(0x15)
$C$DW$253	.dwtag  DW_TAG_member
	.dwattr $C$DW$253, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$253, DW_AT_name("ECDR")
	.dwattr $C$DW$253, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$253, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$253, DW_AT_decl_line(0x35)
	.dwattr $C$DW$253, DW_AT_decl_column(0x15)
$C$DW$254	.dwtag  DW_TAG_member
	.dwattr $C$DW$254, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$254, DW_AT_name("RSVD4")
	.dwattr $C$DW$254, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$254, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$254, DW_AT_decl_line(0x36)
	.dwattr $C$DW$254, DW_AT_decl_column(0x15)
$C$DW$255	.dwtag  DW_TAG_member
	.dwattr $C$DW$255, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$255, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$255, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$255, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$255, DW_AT_decl_line(0x37)
	.dwattr $C$DW$255, DW_AT_decl_column(0x15)
$C$DW$256	.dwtag  DW_TAG_member
	.dwattr $C$DW$256, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$256, DW_AT_name("RSVD5")
	.dwattr $C$DW$256, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$256, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$256, DW_AT_decl_line(0x38)
	.dwattr $C$DW$256, DW_AT_decl_column(0x15)
$C$DW$257	.dwtag  DW_TAG_member
	.dwattr $C$DW$257, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$257, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$257, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$257, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$257, DW_AT_decl_line(0x39)
	.dwattr $C$DW$257, DW_AT_decl_column(0x15)
$C$DW$258	.dwtag  DW_TAG_member
	.dwattr $C$DW$258, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$258, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$258, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$258, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$258, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$258, DW_AT_decl_column(0x15)
$C$DW$259	.dwtag  DW_TAG_member
	.dwattr $C$DW$259, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$259, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$259, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$259, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$259, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$259, DW_AT_decl_column(0x15)
$C$DW$260	.dwtag  DW_TAG_member
	.dwattr $C$DW$260, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$260, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$260, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$260, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$260, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$260, DW_AT_decl_column(0x15)
$C$DW$261	.dwtag  DW_TAG_member
	.dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$261, DW_AT_name("RSVD6")
	.dwattr $C$DW$261, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$261, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$261, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$261, DW_AT_decl_column(0x15)
$C$DW$262	.dwtag  DW_TAG_member
	.dwattr $C$DW$262, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$262, DW_AT_name("DMAIFR")
	.dwattr $C$DW$262, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$262, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$262, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$262, DW_AT_decl_column(0x15)
$C$DW$263	.dwtag  DW_TAG_member
	.dwattr $C$DW$263, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$263, DW_AT_name("DMAIER")
	.dwattr $C$DW$263, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$263, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$263, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$263, DW_AT_decl_column(0x15)
$C$DW$264	.dwtag  DW_TAG_member
	.dwattr $C$DW$264, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$264, DW_AT_name("USBSCR")
	.dwattr $C$DW$264, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$264, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$264, DW_AT_decl_line(0x40)
	.dwattr $C$DW$264, DW_AT_decl_column(0x15)
$C$DW$265	.dwtag  DW_TAG_member
	.dwattr $C$DW$265, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$265, DW_AT_name("ESCR")
	.dwattr $C$DW$265, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$265, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$265, DW_AT_decl_line(0x41)
	.dwattr $C$DW$265, DW_AT_decl_column(0x15)
$C$DW$266	.dwtag  DW_TAG_member
	.dwattr $C$DW$266, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$266, DW_AT_name("RSVD7")
	.dwattr $C$DW$266, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$266, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$266, DW_AT_decl_line(0x42)
	.dwattr $C$DW$266, DW_AT_decl_column(0x15)
$C$DW$267	.dwtag  DW_TAG_member
	.dwattr $C$DW$267, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$267, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$267, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$267, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$267, DW_AT_decl_line(0x43)
	.dwattr $C$DW$267, DW_AT_decl_column(0x15)
$C$DW$268	.dwtag  DW_TAG_member
	.dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$268, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$268, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$268, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$268, DW_AT_decl_line(0x44)
	.dwattr $C$DW$268, DW_AT_decl_column(0x15)
$C$DW$269	.dwtag  DW_TAG_member
	.dwattr $C$DW$269, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$269, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$269, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$269, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$269, DW_AT_decl_line(0x45)
	.dwattr $C$DW$269, DW_AT_decl_column(0x15)
$C$DW$270	.dwtag  DW_TAG_member
	.dwattr $C$DW$270, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$270, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$270, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$270, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$270, DW_AT_decl_line(0x46)
	.dwattr $C$DW$270, DW_AT_decl_column(0x15)
$C$DW$271	.dwtag  DW_TAG_member
	.dwattr $C$DW$271, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$271, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$271, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$271, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$271, DW_AT_decl_line(0x47)
	.dwattr $C$DW$271, DW_AT_decl_column(0x15)
$C$DW$272	.dwtag  DW_TAG_member
	.dwattr $C$DW$272, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$272, DW_AT_name("RSVD8")
	.dwattr $C$DW$272, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$272, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$272, DW_AT_decl_line(0x48)
	.dwattr $C$DW$272, DW_AT_decl_column(0x15)
$C$DW$273	.dwtag  DW_TAG_member
	.dwattr $C$DW$273, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$273, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$273, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$273, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$273, DW_AT_decl_line(0x49)
	.dwattr $C$DW$273, DW_AT_decl_column(0x15)
$C$DW$274	.dwtag  DW_TAG_member
	.dwattr $C$DW$274, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$274, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$274, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$274, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$274, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$274, DW_AT_decl_column(0x15)
$C$DW$275	.dwtag  DW_TAG_member
	.dwattr $C$DW$275, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$275, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$275, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$275, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$275, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$275, DW_AT_decl_column(0x15)
$C$DW$276	.dwtag  DW_TAG_member
	.dwattr $C$DW$276, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$276, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$276, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$276, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$276, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$276, DW_AT_decl_column(0x15)
$C$DW$277	.dwtag  DW_TAG_member
	.dwattr $C$DW$277, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$277, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$277, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$277, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$277, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$277, DW_AT_decl_column(0x15)
$C$DW$278	.dwtag  DW_TAG_member
	.dwattr $C$DW$278, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$278, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$278, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$278, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$278, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$278, DW_AT_decl_column(0x15)
$C$DW$279	.dwtag  DW_TAG_member
	.dwattr $C$DW$279, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$279, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$279, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$279, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$279, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$279, DW_AT_decl_column(0x15)
$C$DW$280	.dwtag  DW_TAG_member
	.dwattr $C$DW$280, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$280, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$280, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$280, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$280, DW_AT_decl_line(0x50)
	.dwattr $C$DW$280, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x11)
$C$DW$T$207	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$207, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$207, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$207, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$T$207, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$207, DW_AT_decl_column(0x03)
$C$DW$281	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$281, DW_AT_type(*$C$DW$T$207)
$C$DW$282	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$282, DW_AT_type(*$C$DW$281)
$C$DW$T$208	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$208, DW_AT_type(*$C$DW$282)
$C$DW$T$209	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$209, DW_AT_type(*$C$DW$T$208)
	.dwattr $C$DW$T$209, DW_AT_address_class(0x10)
$C$DW$T$210	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$210, DW_AT_type(*$C$DW$T$209)
	.dwattr $C$DW$T$210, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$210, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$210, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$210, DW_AT_decl_column(0x30)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x4c)
$C$DW$283	.dwtag  DW_TAG_member
	.dwattr $C$DW$283, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$283, DW_AT_name("IER0")
	.dwattr $C$DW$283, DW_AT_TI_symbol_name("_IER0")
	.dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$283, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$283, DW_AT_decl_line(0x19)
	.dwattr $C$DW$283, DW_AT_decl_column(0x15)
$C$DW$284	.dwtag  DW_TAG_member
	.dwattr $C$DW$284, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$284, DW_AT_name("IFR0")
	.dwattr $C$DW$284, DW_AT_TI_symbol_name("_IFR0")
	.dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$284, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$284, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$284, DW_AT_decl_column(0x15)
$C$DW$285	.dwtag  DW_TAG_member
	.dwattr $C$DW$285, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$285, DW_AT_name("ST0_55")
	.dwattr $C$DW$285, DW_AT_TI_symbol_name("_ST0_55")
	.dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$285, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$285, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$285, DW_AT_decl_column(0x15)
$C$DW$286	.dwtag  DW_TAG_member
	.dwattr $C$DW$286, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$286, DW_AT_name("ST1_55")
	.dwattr $C$DW$286, DW_AT_TI_symbol_name("_ST1_55")
	.dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$286, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$286, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$286, DW_AT_decl_column(0x15)
$C$DW$287	.dwtag  DW_TAG_member
	.dwattr $C$DW$287, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$287, DW_AT_name("ST3_55")
	.dwattr $C$DW$287, DW_AT_TI_symbol_name("_ST3_55")
	.dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$287, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$287, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$287, DW_AT_decl_column(0x15)
$C$DW$288	.dwtag  DW_TAG_member
	.dwattr $C$DW$288, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$288, DW_AT_name("RSVD0")
	.dwattr $C$DW$288, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$288, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$288, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$288, DW_AT_decl_column(0x15)
$C$DW$289	.dwtag  DW_TAG_member
	.dwattr $C$DW$289, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$289, DW_AT_name("IER1")
	.dwattr $C$DW$289, DW_AT_TI_symbol_name("_IER1")
	.dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$289, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$289, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$289, DW_AT_decl_column(0x15)
$C$DW$290	.dwtag  DW_TAG_member
	.dwattr $C$DW$290, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$290, DW_AT_name("IFR1")
	.dwattr $C$DW$290, DW_AT_TI_symbol_name("_IFR1")
	.dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$290, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$290, DW_AT_decl_line(0x20)
	.dwattr $C$DW$290, DW_AT_decl_column(0x15)
$C$DW$291	.dwtag  DW_TAG_member
	.dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$291, DW_AT_name("RSVD1")
	.dwattr $C$DW$291, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$291, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$291, DW_AT_decl_line(0x21)
	.dwattr $C$DW$291, DW_AT_decl_column(0x15)
$C$DW$292	.dwtag  DW_TAG_member
	.dwattr $C$DW$292, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$292, DW_AT_name("IVPD")
	.dwattr $C$DW$292, DW_AT_TI_symbol_name("_IVPD")
	.dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$292, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$292, DW_AT_decl_line(0x22)
	.dwattr $C$DW$292, DW_AT_decl_column(0x15)
$C$DW$293	.dwtag  DW_TAG_member
	.dwattr $C$DW$293, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$293, DW_AT_name("IVPH")
	.dwattr $C$DW$293, DW_AT_TI_symbol_name("_IVPH")
	.dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$293, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$293, DW_AT_decl_line(0x23)
	.dwattr $C$DW$293, DW_AT_decl_column(0x15)
$C$DW$294	.dwtag  DW_TAG_member
	.dwattr $C$DW$294, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$294, DW_AT_name("ST2_55")
	.dwattr $C$DW$294, DW_AT_TI_symbol_name("_ST2_55")
	.dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4b]
	.dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$294, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$294, DW_AT_decl_line(0x24)
	.dwattr $C$DW$294, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x11)
$C$DW$T$211	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegs")
	.dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$211, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$T$211, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
$C$DW$295	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$295, DW_AT_type(*$C$DW$T$211)
$C$DW$T$212	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$212, DW_AT_type(*$C$DW$295)
$C$DW$T$213	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$212)
	.dwattr $C$DW$T$213, DW_AT_address_class(0x17)
$C$DW$T$214	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegsOvly")
	.dwattr $C$DW$T$214, DW_AT_type(*$C$DW$T$213)
	.dwattr $C$DW$T$214, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$214, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$214, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$214, DW_AT_decl_column(0x2e)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x39)
$C$DW$296	.dwtag  DW_TAG_member
	.dwattr $C$DW$296, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$296, DW_AT_name("ICOAR")
	.dwattr $C$DW$296, DW_AT_TI_symbol_name("_ICOAR")
	.dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$296, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$296, DW_AT_decl_line(0x19)
	.dwattr $C$DW$296, DW_AT_decl_column(0x15)
$C$DW$297	.dwtag  DW_TAG_member
	.dwattr $C$DW$297, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$297, DW_AT_name("RSVD0")
	.dwattr $C$DW$297, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$297, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$297, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$297, DW_AT_decl_column(0x15)
$C$DW$298	.dwtag  DW_TAG_member
	.dwattr $C$DW$298, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$298, DW_AT_name("ICIMR")
	.dwattr $C$DW$298, DW_AT_TI_symbol_name("_ICIMR")
	.dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$298, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$298, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$298, DW_AT_decl_column(0x15)
$C$DW$299	.dwtag  DW_TAG_member
	.dwattr $C$DW$299, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$299, DW_AT_name("RSVD1")
	.dwattr $C$DW$299, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$299, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$299, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$299, DW_AT_decl_column(0x15)
$C$DW$300	.dwtag  DW_TAG_member
	.dwattr $C$DW$300, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$300, DW_AT_name("ICSTR")
	.dwattr $C$DW$300, DW_AT_TI_symbol_name("_ICSTR")
	.dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$300, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$300, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$300, DW_AT_decl_column(0x15)
$C$DW$301	.dwtag  DW_TAG_member
	.dwattr $C$DW$301, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$301, DW_AT_name("RSVD2")
	.dwattr $C$DW$301, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$301, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$301, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$301, DW_AT_decl_column(0x15)
$C$DW$302	.dwtag  DW_TAG_member
	.dwattr $C$DW$302, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$302, DW_AT_name("ICCLKL")
	.dwattr $C$DW$302, DW_AT_TI_symbol_name("_ICCLKL")
	.dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$302, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$302, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$302, DW_AT_decl_column(0x15)
$C$DW$303	.dwtag  DW_TAG_member
	.dwattr $C$DW$303, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$303, DW_AT_name("RSVD3")
	.dwattr $C$DW$303, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$303, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$303, DW_AT_decl_line(0x20)
	.dwattr $C$DW$303, DW_AT_decl_column(0x15)
$C$DW$304	.dwtag  DW_TAG_member
	.dwattr $C$DW$304, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$304, DW_AT_name("ICCLKH")
	.dwattr $C$DW$304, DW_AT_TI_symbol_name("_ICCLKH")
	.dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$304, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$304, DW_AT_decl_line(0x21)
	.dwattr $C$DW$304, DW_AT_decl_column(0x15)
$C$DW$305	.dwtag  DW_TAG_member
	.dwattr $C$DW$305, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$305, DW_AT_name("RSVD4")
	.dwattr $C$DW$305, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$305, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$305, DW_AT_decl_line(0x22)
	.dwattr $C$DW$305, DW_AT_decl_column(0x15)
$C$DW$306	.dwtag  DW_TAG_member
	.dwattr $C$DW$306, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$306, DW_AT_name("ICCNT")
	.dwattr $C$DW$306, DW_AT_TI_symbol_name("_ICCNT")
	.dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$306, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$306, DW_AT_decl_line(0x23)
	.dwattr $C$DW$306, DW_AT_decl_column(0x15)
$C$DW$307	.dwtag  DW_TAG_member
	.dwattr $C$DW$307, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$307, DW_AT_name("RSVD5")
	.dwattr $C$DW$307, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$307, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$307, DW_AT_decl_line(0x24)
	.dwattr $C$DW$307, DW_AT_decl_column(0x15)
$C$DW$308	.dwtag  DW_TAG_member
	.dwattr $C$DW$308, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$308, DW_AT_name("ICDRR")
	.dwattr $C$DW$308, DW_AT_TI_symbol_name("_ICDRR")
	.dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$308, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$308, DW_AT_decl_line(0x25)
	.dwattr $C$DW$308, DW_AT_decl_column(0x15)
$C$DW$309	.dwtag  DW_TAG_member
	.dwattr $C$DW$309, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$309, DW_AT_name("RSVD6")
	.dwattr $C$DW$309, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$309, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$309, DW_AT_decl_line(0x26)
	.dwattr $C$DW$309, DW_AT_decl_column(0x15)
$C$DW$310	.dwtag  DW_TAG_member
	.dwattr $C$DW$310, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$310, DW_AT_name("ICSAR")
	.dwattr $C$DW$310, DW_AT_TI_symbol_name("_ICSAR")
	.dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$310, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$310, DW_AT_decl_line(0x27)
	.dwattr $C$DW$310, DW_AT_decl_column(0x15)
$C$DW$311	.dwtag  DW_TAG_member
	.dwattr $C$DW$311, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$311, DW_AT_name("RSVD7")
	.dwattr $C$DW$311, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$311, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$311, DW_AT_decl_line(0x28)
	.dwattr $C$DW$311, DW_AT_decl_column(0x15)
$C$DW$312	.dwtag  DW_TAG_member
	.dwattr $C$DW$312, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$312, DW_AT_name("ICDXR")
	.dwattr $C$DW$312, DW_AT_TI_symbol_name("_ICDXR")
	.dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$312, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$312, DW_AT_decl_line(0x29)
	.dwattr $C$DW$312, DW_AT_decl_column(0x15)
$C$DW$313	.dwtag  DW_TAG_member
	.dwattr $C$DW$313, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$313, DW_AT_name("RSVD8")
	.dwattr $C$DW$313, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$313, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$313, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$313, DW_AT_decl_column(0x15)
$C$DW$314	.dwtag  DW_TAG_member
	.dwattr $C$DW$314, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$314, DW_AT_name("ICMDR")
	.dwattr $C$DW$314, DW_AT_TI_symbol_name("_ICMDR")
	.dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$314, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$314, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$314, DW_AT_decl_column(0x15)
$C$DW$315	.dwtag  DW_TAG_member
	.dwattr $C$DW$315, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$315, DW_AT_name("RSVD9")
	.dwattr $C$DW$315, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$315, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$315, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$315, DW_AT_decl_column(0x15)
$C$DW$316	.dwtag  DW_TAG_member
	.dwattr $C$DW$316, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$316, DW_AT_name("ICIVR")
	.dwattr $C$DW$316, DW_AT_TI_symbol_name("_ICIVR")
	.dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$316, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$316, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$316, DW_AT_decl_column(0x15)
$C$DW$317	.dwtag  DW_TAG_member
	.dwattr $C$DW$317, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$317, DW_AT_name("RSVD10")
	.dwattr $C$DW$317, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$317, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$317, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$317, DW_AT_decl_column(0x15)
$C$DW$318	.dwtag  DW_TAG_member
	.dwattr $C$DW$318, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$318, DW_AT_name("ICEMDR")
	.dwattr $C$DW$318, DW_AT_TI_symbol_name("_ICEMDR")
	.dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$318, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$318, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$318, DW_AT_decl_column(0x15)
$C$DW$319	.dwtag  DW_TAG_member
	.dwattr $C$DW$319, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$319, DW_AT_name("RSVD11")
	.dwattr $C$DW$319, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$319, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$319, DW_AT_decl_line(0x30)
	.dwattr $C$DW$319, DW_AT_decl_column(0x15)
$C$DW$320	.dwtag  DW_TAG_member
	.dwattr $C$DW$320, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$320, DW_AT_name("ICPSC")
	.dwattr $C$DW$320, DW_AT_TI_symbol_name("_ICPSC")
	.dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$320, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$320, DW_AT_decl_line(0x31)
	.dwattr $C$DW$320, DW_AT_decl_column(0x15)
$C$DW$321	.dwtag  DW_TAG_member
	.dwattr $C$DW$321, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$321, DW_AT_name("RSVD12")
	.dwattr $C$DW$321, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$321, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$321, DW_AT_decl_line(0x32)
	.dwattr $C$DW$321, DW_AT_decl_column(0x15)
$C$DW$322	.dwtag  DW_TAG_member
	.dwattr $C$DW$322, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$322, DW_AT_name("ICPID1")
	.dwattr $C$DW$322, DW_AT_TI_symbol_name("_ICPID1")
	.dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$322, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$322, DW_AT_decl_line(0x33)
	.dwattr $C$DW$322, DW_AT_decl_column(0x15)
$C$DW$323	.dwtag  DW_TAG_member
	.dwattr $C$DW$323, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$323, DW_AT_name("RSVD13")
	.dwattr $C$DW$323, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$323, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$323, DW_AT_decl_line(0x34)
	.dwattr $C$DW$323, DW_AT_decl_column(0x15)
$C$DW$324	.dwtag  DW_TAG_member
	.dwattr $C$DW$324, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$324, DW_AT_name("ICPID2")
	.dwattr $C$DW$324, DW_AT_TI_symbol_name("_ICPID2")
	.dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$324, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$324, DW_AT_decl_line(0x35)
	.dwattr $C$DW$324, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x11)
$C$DW$T$215	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
	.dwattr $C$DW$T$215, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$215, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$215, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$T$215, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$215, DW_AT_decl_column(0x03)
$C$DW$325	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$325, DW_AT_type(*$C$DW$T$215)
$C$DW$326	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$326, DW_AT_type(*$C$DW$325)
$C$DW$T$216	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$216, DW_AT_type(*$C$DW$326)
$C$DW$T$217	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$217, DW_AT_type(*$C$DW$T$216)
	.dwattr $C$DW$T$217, DW_AT_address_class(0x10)
$C$DW$T$218	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
	.dwattr $C$DW$T$218, DW_AT_type(*$C$DW$T$217)
	.dwattr $C$DW$T$218, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$218, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$218, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$218, DW_AT_decl_column(0x2f)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_byte_size(0x2e)
$C$DW$327	.dwtag  DW_TAG_member
	.dwattr $C$DW$327, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$327, DW_AT_name("I2SSCTRL")
	.dwattr $C$DW$327, DW_AT_TI_symbol_name("_I2SSCTRL")
	.dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$327, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$327, DW_AT_decl_line(0x19)
	.dwattr $C$DW$327, DW_AT_decl_column(0x15)
$C$DW$328	.dwtag  DW_TAG_member
	.dwattr $C$DW$328, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$328, DW_AT_name("RSVD0")
	.dwattr $C$DW$328, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$328, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$328, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$328, DW_AT_decl_column(0x15)
$C$DW$329	.dwtag  DW_TAG_member
	.dwattr $C$DW$329, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$329, DW_AT_name("I2SSRATE")
	.dwattr $C$DW$329, DW_AT_TI_symbol_name("_I2SSRATE")
	.dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$329, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$329, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$329, DW_AT_decl_column(0x15)
$C$DW$330	.dwtag  DW_TAG_member
	.dwattr $C$DW$330, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$330, DW_AT_name("RSVD1")
	.dwattr $C$DW$330, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$330, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$330, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$330, DW_AT_decl_column(0x15)
$C$DW$331	.dwtag  DW_TAG_member
	.dwattr $C$DW$331, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$331, DW_AT_name("I2STXLT0")
	.dwattr $C$DW$331, DW_AT_TI_symbol_name("_I2STXLT0")
	.dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$331, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$331, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$331, DW_AT_decl_column(0x15)
$C$DW$332	.dwtag  DW_TAG_member
	.dwattr $C$DW$332, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$332, DW_AT_name("I2STXLT1")
	.dwattr $C$DW$332, DW_AT_TI_symbol_name("_I2STXLT1")
	.dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$332, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$332, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$332, DW_AT_decl_column(0x15)
$C$DW$333	.dwtag  DW_TAG_member
	.dwattr $C$DW$333, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$333, DW_AT_name("RSVD2")
	.dwattr $C$DW$333, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$333, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$333, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$333, DW_AT_decl_column(0x15)
$C$DW$334	.dwtag  DW_TAG_member
	.dwattr $C$DW$334, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$334, DW_AT_name("I2STXRT0")
	.dwattr $C$DW$334, DW_AT_TI_symbol_name("_I2STXRT0")
	.dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$334, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$334, DW_AT_decl_line(0x20)
	.dwattr $C$DW$334, DW_AT_decl_column(0x15)
$C$DW$335	.dwtag  DW_TAG_member
	.dwattr $C$DW$335, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$335, DW_AT_name("I2STXRT1")
	.dwattr $C$DW$335, DW_AT_TI_symbol_name("_I2STXRT1")
	.dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$335, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$335, DW_AT_decl_line(0x21)
	.dwattr $C$DW$335, DW_AT_decl_column(0x15)
$C$DW$336	.dwtag  DW_TAG_member
	.dwattr $C$DW$336, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$336, DW_AT_name("RSVD3")
	.dwattr $C$DW$336, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$336, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$336, DW_AT_decl_line(0x22)
	.dwattr $C$DW$336, DW_AT_decl_column(0x15)
$C$DW$337	.dwtag  DW_TAG_member
	.dwattr $C$DW$337, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$337, DW_AT_name("I2SINTFL")
	.dwattr $C$DW$337, DW_AT_TI_symbol_name("_I2SINTFL")
	.dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$337, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$337, DW_AT_decl_line(0x23)
	.dwattr $C$DW$337, DW_AT_decl_column(0x15)
$C$DW$338	.dwtag  DW_TAG_member
	.dwattr $C$DW$338, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$338, DW_AT_name("RSVD4")
	.dwattr $C$DW$338, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$338, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$338, DW_AT_decl_line(0x24)
	.dwattr $C$DW$338, DW_AT_decl_column(0x15)
$C$DW$339	.dwtag  DW_TAG_member
	.dwattr $C$DW$339, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$339, DW_AT_name("I2SINTMASK")
	.dwattr $C$DW$339, DW_AT_TI_symbol_name("_I2SINTMASK")
	.dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$339, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$339, DW_AT_decl_line(0x25)
	.dwattr $C$DW$339, DW_AT_decl_column(0x15)
$C$DW$340	.dwtag  DW_TAG_member
	.dwattr $C$DW$340, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$340, DW_AT_name("RSVD5")
	.dwattr $C$DW$340, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$340, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$340, DW_AT_decl_line(0x26)
	.dwattr $C$DW$340, DW_AT_decl_column(0x15)
$C$DW$341	.dwtag  DW_TAG_member
	.dwattr $C$DW$341, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$341, DW_AT_name("I2SRXLT0")
	.dwattr $C$DW$341, DW_AT_TI_symbol_name("_I2SRXLT0")
	.dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$341, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$341, DW_AT_decl_line(0x27)
	.dwattr $C$DW$341, DW_AT_decl_column(0x15)
$C$DW$342	.dwtag  DW_TAG_member
	.dwattr $C$DW$342, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$342, DW_AT_name("I2SRXLT1")
	.dwattr $C$DW$342, DW_AT_TI_symbol_name("_I2SRXLT1")
	.dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$342, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$342, DW_AT_decl_line(0x28)
	.dwattr $C$DW$342, DW_AT_decl_column(0x15)
$C$DW$343	.dwtag  DW_TAG_member
	.dwattr $C$DW$343, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$343, DW_AT_name("RSVD6")
	.dwattr $C$DW$343, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$343, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$343, DW_AT_decl_line(0x29)
	.dwattr $C$DW$343, DW_AT_decl_column(0x15)
$C$DW$344	.dwtag  DW_TAG_member
	.dwattr $C$DW$344, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$344, DW_AT_name("I2SRXRT0")
	.dwattr $C$DW$344, DW_AT_TI_symbol_name("_I2SRXRT0")
	.dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$344, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$344, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$344, DW_AT_decl_column(0x15)
$C$DW$345	.dwtag  DW_TAG_member
	.dwattr $C$DW$345, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$345, DW_AT_name("I2SRXRT1")
	.dwattr $C$DW$345, DW_AT_TI_symbol_name("_I2SRXRT1")
	.dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$345, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$345, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$345, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x11)
$C$DW$T$98	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$98, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
$C$DW$346	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$346, DW_AT_type(*$C$DW$T$98)
$C$DW$347	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$347, DW_AT_type(*$C$DW$346)
$C$DW$T$99	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$347)
$C$DW$T$100	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$T$100, DW_AT_address_class(0x10)
$C$DW$348	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$348, DW_AT_type(*$C$DW$T$98)
$C$DW$349	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$349, DW_AT_type(*$C$DW$348)
$C$DW$T$219	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$349)
$C$DW$T$220	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$220, DW_AT_address_class(0x10)
$C$DW$T$221	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegsOvly")
	.dwattr $C$DW$T$221, DW_AT_type(*$C$DW$T$220)
	.dwattr $C$DW$T$221, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$221, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$221, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$221, DW_AT_decl_column(0x31)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0xde)
$C$DW$350	.dwtag  DW_TAG_member
	.dwattr $C$DW$350, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$350, DW_AT_name("REV")
	.dwattr $C$DW$350, DW_AT_TI_symbol_name("_REV")
	.dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$350, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$350, DW_AT_decl_line(0x19)
	.dwattr $C$DW$350, DW_AT_decl_column(0x15)
$C$DW$351	.dwtag  DW_TAG_member
	.dwattr $C$DW$351, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$351, DW_AT_name("STATUS")
	.dwattr $C$DW$351, DW_AT_TI_symbol_name("_STATUS")
	.dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$351, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$351, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$351, DW_AT_decl_column(0x15)
$C$DW$352	.dwtag  DW_TAG_member
	.dwattr $C$DW$352, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$352, DW_AT_name("RSVD0")
	.dwattr $C$DW$352, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$352, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$352, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$352, DW_AT_decl_column(0x15)
$C$DW$353	.dwtag  DW_TAG_member
	.dwattr $C$DW$353, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$353, DW_AT_name("AWCCR1")
	.dwattr $C$DW$353, DW_AT_TI_symbol_name("_AWCCR1")
	.dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$353, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$353, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$353, DW_AT_decl_column(0x15)
$C$DW$354	.dwtag  DW_TAG_member
	.dwattr $C$DW$354, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$354, DW_AT_name("AWCCR2")
	.dwattr $C$DW$354, DW_AT_TI_symbol_name("_AWCCR2")
	.dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$354, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$354, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$354, DW_AT_decl_column(0x15)
$C$DW$355	.dwtag  DW_TAG_member
	.dwattr $C$DW$355, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$355, DW_AT_name("RSVD1")
	.dwattr $C$DW$355, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$355, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$355, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$355, DW_AT_decl_column(0x15)
$C$DW$356	.dwtag  DW_TAG_member
	.dwattr $C$DW$356, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$356, DW_AT_name("SDCR1")
	.dwattr $C$DW$356, DW_AT_TI_symbol_name("_SDCR1")
	.dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$356, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$356, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$356, DW_AT_decl_column(0x15)
$C$DW$357	.dwtag  DW_TAG_member
	.dwattr $C$DW$357, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$357, DW_AT_name("SDCR2")
	.dwattr $C$DW$357, DW_AT_TI_symbol_name("_SDCR2")
	.dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$357, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$357, DW_AT_decl_line(0x20)
	.dwattr $C$DW$357, DW_AT_decl_column(0x15)
$C$DW$358	.dwtag  DW_TAG_member
	.dwattr $C$DW$358, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$358, DW_AT_name("RSVD2")
	.dwattr $C$DW$358, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$358, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$358, DW_AT_decl_line(0x21)
	.dwattr $C$DW$358, DW_AT_decl_column(0x15)
$C$DW$359	.dwtag  DW_TAG_member
	.dwattr $C$DW$359, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$359, DW_AT_name("SDRCR")
	.dwattr $C$DW$359, DW_AT_TI_symbol_name("_SDRCR")
	.dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$359, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$359, DW_AT_decl_line(0x22)
	.dwattr $C$DW$359, DW_AT_decl_column(0x15)
$C$DW$360	.dwtag  DW_TAG_member
	.dwattr $C$DW$360, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$360, DW_AT_name("RSVD3")
	.dwattr $C$DW$360, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$360, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$360, DW_AT_decl_line(0x23)
	.dwattr $C$DW$360, DW_AT_decl_column(0x15)
$C$DW$361	.dwtag  DW_TAG_member
	.dwattr $C$DW$361, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$361, DW_AT_name("ACS2CR1")
	.dwattr $C$DW$361, DW_AT_TI_symbol_name("_ACS2CR1")
	.dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$361, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$361, DW_AT_decl_line(0x24)
	.dwattr $C$DW$361, DW_AT_decl_column(0x15)
$C$DW$362	.dwtag  DW_TAG_member
	.dwattr $C$DW$362, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$362, DW_AT_name("ACS2CR2")
	.dwattr $C$DW$362, DW_AT_TI_symbol_name("_ACS2CR2")
	.dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$362, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$362, DW_AT_decl_line(0x25)
	.dwattr $C$DW$362, DW_AT_decl_column(0x15)
$C$DW$363	.dwtag  DW_TAG_member
	.dwattr $C$DW$363, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$363, DW_AT_name("RSVD4")
	.dwattr $C$DW$363, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$363, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$363, DW_AT_decl_line(0x26)
	.dwattr $C$DW$363, DW_AT_decl_column(0x15)
$C$DW$364	.dwtag  DW_TAG_member
	.dwattr $C$DW$364, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$364, DW_AT_name("ACS3CR1")
	.dwattr $C$DW$364, DW_AT_TI_symbol_name("_ACS3CR1")
	.dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$364, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$364, DW_AT_decl_line(0x27)
	.dwattr $C$DW$364, DW_AT_decl_column(0x15)
$C$DW$365	.dwtag  DW_TAG_member
	.dwattr $C$DW$365, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$365, DW_AT_name("ACS3CR2")
	.dwattr $C$DW$365, DW_AT_TI_symbol_name("_ACS3CR2")
	.dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$365, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$365, DW_AT_decl_line(0x28)
	.dwattr $C$DW$365, DW_AT_decl_column(0x15)
$C$DW$366	.dwtag  DW_TAG_member
	.dwattr $C$DW$366, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$366, DW_AT_name("RSVD5")
	.dwattr $C$DW$366, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$366, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$366, DW_AT_decl_line(0x29)
	.dwattr $C$DW$366, DW_AT_decl_column(0x15)
$C$DW$367	.dwtag  DW_TAG_member
	.dwattr $C$DW$367, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$367, DW_AT_name("ACS4CR1")
	.dwattr $C$DW$367, DW_AT_TI_symbol_name("_ACS4CR1")
	.dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$367, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$367, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$367, DW_AT_decl_column(0x15)
$C$DW$368	.dwtag  DW_TAG_member
	.dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$368, DW_AT_name("ACS4CR2")
	.dwattr $C$DW$368, DW_AT_TI_symbol_name("_ACS4CR2")
	.dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$368, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$368, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$368, DW_AT_decl_column(0x15)
$C$DW$369	.dwtag  DW_TAG_member
	.dwattr $C$DW$369, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$369, DW_AT_name("RSVD6")
	.dwattr $C$DW$369, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$369, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$369, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$369, DW_AT_decl_column(0x15)
$C$DW$370	.dwtag  DW_TAG_member
	.dwattr $C$DW$370, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$370, DW_AT_name("ACS5CR1")
	.dwattr $C$DW$370, DW_AT_TI_symbol_name("_ACS5CR1")
	.dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$370, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$370, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$370, DW_AT_decl_column(0x15)
$C$DW$371	.dwtag  DW_TAG_member
	.dwattr $C$DW$371, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$371, DW_AT_name("ACS5CR2")
	.dwattr $C$DW$371, DW_AT_TI_symbol_name("_ACS5CR2")
	.dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$371, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$371, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$371, DW_AT_decl_column(0x15)
$C$DW$372	.dwtag  DW_TAG_member
	.dwattr $C$DW$372, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$372, DW_AT_name("RSVD7")
	.dwattr $C$DW$372, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$372, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$372, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$372, DW_AT_decl_column(0x15)
$C$DW$373	.dwtag  DW_TAG_member
	.dwattr $C$DW$373, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$373, DW_AT_name("SDTIMR1")
	.dwattr $C$DW$373, DW_AT_TI_symbol_name("_SDTIMR1")
	.dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$373, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$373, DW_AT_decl_line(0x30)
	.dwattr $C$DW$373, DW_AT_decl_column(0x15)
$C$DW$374	.dwtag  DW_TAG_member
	.dwattr $C$DW$374, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$374, DW_AT_name("RSVD8")
	.dwattr $C$DW$374, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$374, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$374, DW_AT_decl_line(0x31)
	.dwattr $C$DW$374, DW_AT_decl_column(0x15)
$C$DW$375	.dwtag  DW_TAG_member
	.dwattr $C$DW$375, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$375, DW_AT_name("SDSRETR")
	.dwattr $C$DW$375, DW_AT_TI_symbol_name("_SDSRETR")
	.dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$375, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$375, DW_AT_decl_line(0x32)
	.dwattr $C$DW$375, DW_AT_decl_column(0x15)
$C$DW$376	.dwtag  DW_TAG_member
	.dwattr $C$DW$376, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$376, DW_AT_name("RSVD9")
	.dwattr $C$DW$376, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$376, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$376, DW_AT_decl_line(0x33)
	.dwattr $C$DW$376, DW_AT_decl_column(0x15)
$C$DW$377	.dwtag  DW_TAG_member
	.dwattr $C$DW$377, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$377, DW_AT_name("EIRR")
	.dwattr $C$DW$377, DW_AT_TI_symbol_name("_EIRR")
	.dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$377, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$377, DW_AT_decl_line(0x34)
	.dwattr $C$DW$377, DW_AT_decl_column(0x15)
$C$DW$378	.dwtag  DW_TAG_member
	.dwattr $C$DW$378, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$378, DW_AT_name("RSVD10")
	.dwattr $C$DW$378, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$378, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$378, DW_AT_decl_line(0x35)
	.dwattr $C$DW$378, DW_AT_decl_column(0x15)
$C$DW$379	.dwtag  DW_TAG_member
	.dwattr $C$DW$379, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$379, DW_AT_name("EIMR")
	.dwattr $C$DW$379, DW_AT_TI_symbol_name("_EIMR")
	.dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$379, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$379, DW_AT_decl_line(0x36)
	.dwattr $C$DW$379, DW_AT_decl_column(0x15)
$C$DW$380	.dwtag  DW_TAG_member
	.dwattr $C$DW$380, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$380, DW_AT_name("RSVD11")
	.dwattr $C$DW$380, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$380, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$380, DW_AT_decl_line(0x37)
	.dwattr $C$DW$380, DW_AT_decl_column(0x15)
$C$DW$381	.dwtag  DW_TAG_member
	.dwattr $C$DW$381, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$381, DW_AT_name("EIMSR")
	.dwattr $C$DW$381, DW_AT_TI_symbol_name("_EIMSR")
	.dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$381, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$381, DW_AT_decl_line(0x38)
	.dwattr $C$DW$381, DW_AT_decl_column(0x15)
$C$DW$382	.dwtag  DW_TAG_member
	.dwattr $C$DW$382, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$382, DW_AT_name("RSVD12")
	.dwattr $C$DW$382, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$382, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$382, DW_AT_decl_line(0x39)
	.dwattr $C$DW$382, DW_AT_decl_column(0x15)
$C$DW$383	.dwtag  DW_TAG_member
	.dwattr $C$DW$383, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$383, DW_AT_name("EIMCR")
	.dwattr $C$DW$383, DW_AT_TI_symbol_name("_EIMCR")
	.dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$383, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$383, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$383, DW_AT_decl_column(0x15)
$C$DW$384	.dwtag  DW_TAG_member
	.dwattr $C$DW$384, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$384, DW_AT_name("RSVD13")
	.dwattr $C$DW$384, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$384, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$384, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$384, DW_AT_decl_column(0x15)
$C$DW$385	.dwtag  DW_TAG_member
	.dwattr $C$DW$385, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$385, DW_AT_name("NANDFCR")
	.dwattr $C$DW$385, DW_AT_TI_symbol_name("_NANDFCR")
	.dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$385, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$385, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$385, DW_AT_decl_column(0x15)
$C$DW$386	.dwtag  DW_TAG_member
	.dwattr $C$DW$386, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$386, DW_AT_name("RSVD14")
	.dwattr $C$DW$386, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$386, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$386, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$386, DW_AT_decl_column(0x15)
$C$DW$387	.dwtag  DW_TAG_member
	.dwattr $C$DW$387, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$387, DW_AT_name("NANDFSR1")
	.dwattr $C$DW$387, DW_AT_TI_symbol_name("_NANDFSR1")
	.dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$387, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$387, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$387, DW_AT_decl_column(0x15)
$C$DW$388	.dwtag  DW_TAG_member
