;*******************************************************************************
;* TMS320C55x C/C++ Codegen                                          PC v4.3.8 *
;* Date/Time created: Mon Nov 30 20:39:20 2015                                 *
;*******************************************************************************
	.compiler_opts --hll_source=on --mem_model:code=flat --mem_model:data=large --silicon_core_3_3 --symdebug:dwarf 
	.mmregs
	.cpl_on
	.arms_on
	.c54cm_off
	.asg AR6, FP
	.asg XAR6, XFP
	.asg DPH, MDP
	.model call=c55_std
	.model mem=large
	.noremark 5002  ; code respects overwrite rules
;*******************************************************************************
;* GLOBAL FILE PARAMETERS                                                      *
;*                                                                             *
;*   Architecture       : TMS320C55x                                           *
;*   Optimizing for     : Speed                                                *
;*   Memory             : Large Model (23-Bit Data Pointers)                   *
;*   Calls              : Normal Library ASM calls                             *
;*   Debug Info         : Standard TI Debug Information                        *
;*******************************************************************************

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("../main.c")

	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x16)
$C$DW$35	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$35, DW_AT_upper_bound(0x15)
	.dwendtag $C$DW$T$74


$C$DW$T$75	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x52)
$C$DW$36	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$36, DW_AT_upper_bound(0x51)
	.dwendtag $C$DW$T$75


$C$DW$T$76	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$76, DW_AT_byte_size(0xf66)
$C$DW$37	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$37, DW_AT_upper_bound(0xf65)
	.dwendtag $C$DW$T$76


$C$DW$T$79	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_byte_size(0xf00)
$C$DW$38	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$38, DW_AT_upper_bound(0xeff)
	.dwendtag $C$DW$T$79


$C$DW$T$82	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x400)
$C$DW$39	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$39, DW_AT_upper_bound(0x3ff)
	.dwendtag $C$DW$T$82

$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
$C$DW$T$95	.dwtag  DW_TAG_typedef, DW_AT_name("Bool")
	.dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$95, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$95, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$95, DW_AT_decl_column(0x0e)
$C$DW$T$96	.dwtag  DW_TAG_typedef, DW_AT_name("Int")
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$96, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x19)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
$C$DW$T$99	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$99, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$99, DW_AT_decl_line(0x19)
	.dwattr $C$DW$T$99, DW_AT_decl_column(0x19)
$C$DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("Uns")
	.dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$100, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x19)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("long")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
$C$DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
	.dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$101, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$101, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$101, DW_AT_decl_column(0x0e)
$C$DW$T$102	.dwtag  DW_TAG_typedef, DW_AT_name("Int32")
	.dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$102, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$102, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$102, DW_AT_decl_column(0x0f)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned long")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
$C$DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32")
	.dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$103, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/tistdtypes.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x17)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$14, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$14, DW_AT_bit_offset(0x18)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
	.dwattr $C$DW$T$15, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$15, DW_AT_bit_offset(0x18)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x02)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_byte_size(0x0c)
$C$DW$40	.dwtag  DW_TAG_member
	.dwattr $C$DW$40, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$40, DW_AT_name("fd")
	.dwattr $C$DW$40, DW_AT_TI_symbol_name("_fd")
	.dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$40, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$40, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$40, DW_AT_decl_column(0x0b)
$C$DW$41	.dwtag  DW_TAG_member
	.dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$41, DW_AT_name("buf")
	.dwattr $C$DW$41, DW_AT_TI_symbol_name("_buf")
	.dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$41, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$41, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$41, DW_AT_decl_column(0x16)
$C$DW$42	.dwtag  DW_TAG_member
	.dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$42, DW_AT_name("pos")
	.dwattr $C$DW$42, DW_AT_TI_symbol_name("_pos")
	.dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$42, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$42, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$42, DW_AT_decl_column(0x16)
$C$DW$43	.dwtag  DW_TAG_member
	.dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$43, DW_AT_name("bufend")
	.dwattr $C$DW$43, DW_AT_TI_symbol_name("_bufend")
	.dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$43, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$43, DW_AT_decl_line(0x20)
	.dwattr $C$DW$43, DW_AT_decl_column(0x16)
$C$DW$44	.dwtag  DW_TAG_member
	.dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$44, DW_AT_name("buff_stop")
	.dwattr $C$DW$44, DW_AT_TI_symbol_name("_buff_stop")
	.dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$44, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$44, DW_AT_decl_line(0x21)
	.dwattr $C$DW$44, DW_AT_decl_column(0x16)
$C$DW$45	.dwtag  DW_TAG_member
	.dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$45, DW_AT_name("flags")
	.dwattr $C$DW$45, DW_AT_TI_symbol_name("_flags")
	.dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$45, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$45, DW_AT_decl_line(0x22)
	.dwattr $C$DW$45, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$104	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$104, DW_AT_decl_file("E:/Program Files/Texas Instruments/CCS/ccsv4/tools/compiler/c5500/include/stdio.h")
	.dwattr $C$DW$T$104, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$104, DW_AT_decl_column(0x03)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x48)
$C$DW$46	.dwtag  DW_TAG_member
	.dwattr $C$DW$46, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$46, DW_AT_name("EBSR")
	.dwattr $C$DW$46, DW_AT_TI_symbol_name("_EBSR")
	.dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$46, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$46, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$46, DW_AT_decl_column(0x15)
$C$DW$47	.dwtag  DW_TAG_member
	.dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$47, DW_AT_name("RSVD0")
	.dwattr $C$DW$47, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$47, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$47, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$47, DW_AT_decl_column(0x15)
$C$DW$48	.dwtag  DW_TAG_member
	.dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$48, DW_AT_name("PCGCR1")
	.dwattr $C$DW$48, DW_AT_TI_symbol_name("_PCGCR1")
	.dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$48, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$48, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$48, DW_AT_decl_column(0x15)
$C$DW$49	.dwtag  DW_TAG_member
	.dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$49, DW_AT_name("PCGCR2")
	.dwattr $C$DW$49, DW_AT_TI_symbol_name("_PCGCR2")
	.dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$49, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$49, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$49, DW_AT_decl_column(0x15)
$C$DW$50	.dwtag  DW_TAG_member
	.dwattr $C$DW$50, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$50, DW_AT_name("PSRCR")
	.dwattr $C$DW$50, DW_AT_TI_symbol_name("_PSRCR")
	.dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$50, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$50, DW_AT_decl_line(0x20)
	.dwattr $C$DW$50, DW_AT_decl_column(0x15)
$C$DW$51	.dwtag  DW_TAG_member
	.dwattr $C$DW$51, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$51, DW_AT_name("PRCR")
	.dwattr $C$DW$51, DW_AT_TI_symbol_name("_PRCR")
	.dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$51, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$51, DW_AT_decl_line(0x21)
	.dwattr $C$DW$51, DW_AT_decl_column(0x15)
$C$DW$52	.dwtag  DW_TAG_member
	.dwattr $C$DW$52, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$52, DW_AT_name("RSVD1")
	.dwattr $C$DW$52, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$52, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$52, DW_AT_decl_line(0x22)
	.dwattr $C$DW$52, DW_AT_decl_column(0x15)
$C$DW$53	.dwtag  DW_TAG_member
	.dwattr $C$DW$53, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$53, DW_AT_name("TIAFR")
	.dwattr $C$DW$53, DW_AT_TI_symbol_name("_TIAFR")
	.dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$53, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$53, DW_AT_decl_line(0x23)
	.dwattr $C$DW$53, DW_AT_decl_column(0x15)
$C$DW$54	.dwtag  DW_TAG_member
	.dwattr $C$DW$54, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$54, DW_AT_name("RSVD2")
	.dwattr $C$DW$54, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$54, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$54, DW_AT_decl_line(0x24)
	.dwattr $C$DW$54, DW_AT_decl_column(0x15)
$C$DW$55	.dwtag  DW_TAG_member
	.dwattr $C$DW$55, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$55, DW_AT_name("ODSCR")
	.dwattr $C$DW$55, DW_AT_TI_symbol_name("_ODSCR")
	.dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$55, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$55, DW_AT_decl_line(0x25)
	.dwattr $C$DW$55, DW_AT_decl_column(0x15)
$C$DW$56	.dwtag  DW_TAG_member
	.dwattr $C$DW$56, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$56, DW_AT_name("PDINHIBR1")
	.dwattr $C$DW$56, DW_AT_TI_symbol_name("_PDINHIBR1")
	.dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$56, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$56, DW_AT_decl_line(0x26)
	.dwattr $C$DW$56, DW_AT_decl_column(0x15)
$C$DW$57	.dwtag  DW_TAG_member
	.dwattr $C$DW$57, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$57, DW_AT_name("PDINHIBR2")
	.dwattr $C$DW$57, DW_AT_TI_symbol_name("_PDINHIBR2")
	.dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$57, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$57, DW_AT_decl_line(0x27)
	.dwattr $C$DW$57, DW_AT_decl_column(0x15)
$C$DW$58	.dwtag  DW_TAG_member
	.dwattr $C$DW$58, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$58, DW_AT_name("PDINHIBR3")
	.dwattr $C$DW$58, DW_AT_TI_symbol_name("_PDINHIBR3")
	.dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$58, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$58, DW_AT_decl_line(0x28)
	.dwattr $C$DW$58, DW_AT_decl_column(0x15)
$C$DW$59	.dwtag  DW_TAG_member
	.dwattr $C$DW$59, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$59, DW_AT_name("DMA0CESR1")
	.dwattr $C$DW$59, DW_AT_TI_symbol_name("_DMA0CESR1")
	.dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$59, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$59, DW_AT_decl_line(0x29)
	.dwattr $C$DW$59, DW_AT_decl_column(0x15)
$C$DW$60	.dwtag  DW_TAG_member
	.dwattr $C$DW$60, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$60, DW_AT_name("DMA0CESR2")
	.dwattr $C$DW$60, DW_AT_TI_symbol_name("_DMA0CESR2")
	.dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
	.dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$60, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$60, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$60, DW_AT_decl_column(0x15)
$C$DW$61	.dwtag  DW_TAG_member
	.dwattr $C$DW$61, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$61, DW_AT_name("DMA1CESR1")
	.dwattr $C$DW$61, DW_AT_TI_symbol_name("_DMA1CESR1")
	.dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$61, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$61, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$61, DW_AT_decl_column(0x15)
$C$DW$62	.dwtag  DW_TAG_member
	.dwattr $C$DW$62, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$62, DW_AT_name("DMA1CESR2")
	.dwattr $C$DW$62, DW_AT_TI_symbol_name("_DMA1CESR2")
	.dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$62, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$62, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$62, DW_AT_decl_column(0x15)
$C$DW$63	.dwtag  DW_TAG_member
	.dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$63, DW_AT_name("SDRAMCCR")
	.dwattr $C$DW$63, DW_AT_TI_symbol_name("_SDRAMCCR")
	.dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$63, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$63, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$63, DW_AT_decl_column(0x15)
$C$DW$64	.dwtag  DW_TAG_member
	.dwattr $C$DW$64, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$64, DW_AT_name("CCR2")
	.dwattr $C$DW$64, DW_AT_TI_symbol_name("_CCR2")
	.dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
	.dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$64, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$64, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$64, DW_AT_decl_column(0x15)
$C$DW$65	.dwtag  DW_TAG_member
	.dwattr $C$DW$65, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$65, DW_AT_name("CGCR1")
	.dwattr $C$DW$65, DW_AT_TI_symbol_name("_CGCR1")
	.dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$65, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$65, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$65, DW_AT_decl_column(0x15)
$C$DW$66	.dwtag  DW_TAG_member
	.dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$66, DW_AT_name("CGICR")
	.dwattr $C$DW$66, DW_AT_TI_symbol_name("_CGICR")
	.dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$66, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$66, DW_AT_decl_line(0x30)
	.dwattr $C$DW$66, DW_AT_decl_column(0x15)
$C$DW$67	.dwtag  DW_TAG_member
	.dwattr $C$DW$67, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$67, DW_AT_name("CGCR2")
	.dwattr $C$DW$67, DW_AT_TI_symbol_name("_CGCR2")
	.dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
	.dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$67, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$67, DW_AT_decl_line(0x31)
	.dwattr $C$DW$67, DW_AT_decl_column(0x15)
$C$DW$68	.dwtag  DW_TAG_member
	.dwattr $C$DW$68, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$68, DW_AT_name("CGOCR")
	.dwattr $C$DW$68, DW_AT_TI_symbol_name("_CGOCR")
	.dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
	.dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$68, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$68, DW_AT_decl_line(0x32)
	.dwattr $C$DW$68, DW_AT_decl_column(0x15)
$C$DW$69	.dwtag  DW_TAG_member
	.dwattr $C$DW$69, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$69, DW_AT_name("CCSSR")
	.dwattr $C$DW$69, DW_AT_TI_symbol_name("_CCSSR")
	.dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$69, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$69, DW_AT_decl_line(0x33)
	.dwattr $C$DW$69, DW_AT_decl_column(0x15)
$C$DW$70	.dwtag  DW_TAG_member
	.dwattr $C$DW$70, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$70, DW_AT_name("RSVD3")
	.dwattr $C$DW$70, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$70, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$70, DW_AT_decl_line(0x34)
	.dwattr $C$DW$70, DW_AT_decl_column(0x15)
$C$DW$71	.dwtag  DW_TAG_member
	.dwattr $C$DW$71, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$71, DW_AT_name("ECDR")
	.dwattr $C$DW$71, DW_AT_TI_symbol_name("_ECDR")
	.dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
	.dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$71, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$71, DW_AT_decl_line(0x35)
	.dwattr $C$DW$71, DW_AT_decl_column(0x15)
$C$DW$72	.dwtag  DW_TAG_member
	.dwattr $C$DW$72, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$72, DW_AT_name("RSVD4")
	.dwattr $C$DW$72, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$72, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$72, DW_AT_decl_line(0x36)
	.dwattr $C$DW$72, DW_AT_decl_column(0x15)
$C$DW$73	.dwtag  DW_TAG_member
	.dwattr $C$DW$73, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$73, DW_AT_name("RAMSLPMDCNTLR1")
	.dwattr $C$DW$73, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR1")
	.dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$73, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$73, DW_AT_decl_line(0x37)
	.dwattr $C$DW$73, DW_AT_decl_column(0x15)
$C$DW$74	.dwtag  DW_TAG_member
	.dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$74, DW_AT_name("RSVD5")
	.dwattr $C$DW$74, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$74, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$74, DW_AT_decl_line(0x38)
	.dwattr $C$DW$74, DW_AT_decl_column(0x15)
$C$DW$75	.dwtag  DW_TAG_member
	.dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$75, DW_AT_name("RAMSLPMDCNTLR2")
	.dwattr $C$DW$75, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR2")
	.dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$75, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$75, DW_AT_decl_line(0x39)
	.dwattr $C$DW$75, DW_AT_decl_column(0x15)
$C$DW$76	.dwtag  DW_TAG_member
	.dwattr $C$DW$76, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$76, DW_AT_name("RAMSLPMDCNTLR3")
	.dwattr $C$DW$76, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR3")
	.dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
	.dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$76, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$76, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$76, DW_AT_decl_column(0x15)
$C$DW$77	.dwtag  DW_TAG_member
	.dwattr $C$DW$77, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$77, DW_AT_name("RAMSLPMDCNTLR4")
	.dwattr $C$DW$77, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR4")
	.dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$77, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$77, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$77, DW_AT_decl_column(0x15)
$C$DW$78	.dwtag  DW_TAG_member
	.dwattr $C$DW$78, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$78, DW_AT_name("RAMSLPMDCNTLR5")
	.dwattr $C$DW$78, DW_AT_TI_symbol_name("_RAMSLPMDCNTLR5")
	.dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$78, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$78, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$78, DW_AT_decl_column(0x15)
$C$DW$79	.dwtag  DW_TAG_member
	.dwattr $C$DW$79, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$79, DW_AT_name("RSVD6")
	.dwattr $C$DW$79, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$79, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$79, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$79, DW_AT_decl_column(0x15)
$C$DW$80	.dwtag  DW_TAG_member
	.dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$80, DW_AT_name("DMAIFR")
	.dwattr $C$DW$80, DW_AT_TI_symbol_name("_DMAIFR")
	.dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$80, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$80, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$80, DW_AT_decl_column(0x15)
$C$DW$81	.dwtag  DW_TAG_member
	.dwattr $C$DW$81, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$81, DW_AT_name("DMAIER")
	.dwattr $C$DW$81, DW_AT_TI_symbol_name("_DMAIER")
	.dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$81, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$81, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$81, DW_AT_decl_column(0x15)
$C$DW$82	.dwtag  DW_TAG_member
	.dwattr $C$DW$82, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$82, DW_AT_name("USBSCR")
	.dwattr $C$DW$82, DW_AT_TI_symbol_name("_USBSCR")
	.dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$82, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$82, DW_AT_decl_line(0x40)
	.dwattr $C$DW$82, DW_AT_decl_column(0x15)
$C$DW$83	.dwtag  DW_TAG_member
	.dwattr $C$DW$83, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$83, DW_AT_name("ESCR")
	.dwattr $C$DW$83, DW_AT_TI_symbol_name("_ESCR")
	.dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
	.dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$83, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$83, DW_AT_decl_line(0x41)
	.dwattr $C$DW$83, DW_AT_decl_column(0x15)
$C$DW$84	.dwtag  DW_TAG_member
	.dwattr $C$DW$84, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$84, DW_AT_name("RSVD7")
	.dwattr $C$DW$84, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$84, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$84, DW_AT_decl_line(0x42)
	.dwattr $C$DW$84, DW_AT_decl_column(0x15)
$C$DW$85	.dwtag  DW_TAG_member
	.dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$85, DW_AT_name("DMA2CESR1")
	.dwattr $C$DW$85, DW_AT_TI_symbol_name("_DMA2CESR1")
	.dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$85, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$85, DW_AT_decl_line(0x43)
	.dwattr $C$DW$85, DW_AT_decl_column(0x15)
$C$DW$86	.dwtag  DW_TAG_member
	.dwattr $C$DW$86, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$86, DW_AT_name("DMA2CESR2")
	.dwattr $C$DW$86, DW_AT_TI_symbol_name("_DMA2CESR2")
	.dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x37]
	.dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$86, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$86, DW_AT_decl_line(0x44)
	.dwattr $C$DW$86, DW_AT_decl_column(0x15)
$C$DW$87	.dwtag  DW_TAG_member
	.dwattr $C$DW$87, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$87, DW_AT_name("DMA3CESR1")
	.dwattr $C$DW$87, DW_AT_TI_symbol_name("_DMA3CESR1")
	.dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$87, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$87, DW_AT_decl_line(0x45)
	.dwattr $C$DW$87, DW_AT_decl_column(0x15)
$C$DW$88	.dwtag  DW_TAG_member
	.dwattr $C$DW$88, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$88, DW_AT_name("DMA3CESR2")
	.dwattr $C$DW$88, DW_AT_TI_symbol_name("_DMA3CESR2")
	.dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x39]
	.dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$88, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$88, DW_AT_decl_line(0x46)
	.dwattr $C$DW$88, DW_AT_decl_column(0x15)
$C$DW$89	.dwtag  DW_TAG_member
	.dwattr $C$DW$89, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$89, DW_AT_name("CLKSTOP")
	.dwattr $C$DW$89, DW_AT_TI_symbol_name("_CLKSTOP")
	.dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$89, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$89, DW_AT_decl_line(0x47)
	.dwattr $C$DW$89, DW_AT_decl_column(0x15)
$C$DW$90	.dwtag  DW_TAG_member
	.dwattr $C$DW$90, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$90, DW_AT_name("RSVD8")
	.dwattr $C$DW$90, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3b]
	.dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$90, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$90, DW_AT_decl_line(0x48)
	.dwattr $C$DW$90, DW_AT_decl_column(0x15)
$C$DW$91	.dwtag  DW_TAG_member
	.dwattr $C$DW$91, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$91, DW_AT_name("DIEIDR0")
	.dwattr $C$DW$91, DW_AT_TI_symbol_name("_DIEIDR0")
	.dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$91, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$91, DW_AT_decl_line(0x49)
	.dwattr $C$DW$91, DW_AT_decl_column(0x15)
$C$DW$92	.dwtag  DW_TAG_member
	.dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$92, DW_AT_name("DIEIDR1")
	.dwattr $C$DW$92, DW_AT_TI_symbol_name("_DIEIDR1")
	.dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$92, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$92, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$92, DW_AT_decl_column(0x15)
$C$DW$93	.dwtag  DW_TAG_member
	.dwattr $C$DW$93, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$93, DW_AT_name("DIEIDR2")
	.dwattr $C$DW$93, DW_AT_TI_symbol_name("_DIEIDR2")
	.dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$93, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$93, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$93, DW_AT_decl_column(0x15)
$C$DW$94	.dwtag  DW_TAG_member
	.dwattr $C$DW$94, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$94, DW_AT_name("DIEIDR3")
	.dwattr $C$DW$94, DW_AT_TI_symbol_name("_DIEIDR3")
	.dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x43]
	.dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$94, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$94, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$94, DW_AT_decl_column(0x15)
$C$DW$95	.dwtag  DW_TAG_member
	.dwattr $C$DW$95, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$95, DW_AT_name("DIEIDR4")
	.dwattr $C$DW$95, DW_AT_TI_symbol_name("_DIEIDR4")
	.dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$95, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$95, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$95, DW_AT_decl_column(0x15)
$C$DW$96	.dwtag  DW_TAG_member
	.dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$96, DW_AT_name("DIEIDR5")
	.dwattr $C$DW$96, DW_AT_TI_symbol_name("_DIEIDR5")
	.dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$96, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$96, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$96, DW_AT_decl_column(0x15)
$C$DW$97	.dwtag  DW_TAG_member
	.dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$97, DW_AT_name("DIEIDR6")
	.dwattr $C$DW$97, DW_AT_TI_symbol_name("_DIEIDR6")
	.dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$97, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$97, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$97, DW_AT_decl_column(0x15)
$C$DW$98	.dwtag  DW_TAG_member
	.dwattr $C$DW$98, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$98, DW_AT_name("DIEIDR7")
	.dwattr $C$DW$98, DW_AT_TI_symbol_name("_DIEIDR7")
	.dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$98, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$98, DW_AT_decl_line(0x50)
	.dwattr $C$DW$98, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x11)
$C$DW$T$105	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegs")
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$105, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_sysctrl.h")
	.dwattr $C$DW$T$105, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$105, DW_AT_decl_column(0x03)
$C$DW$99	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$99, DW_AT_type(*$C$DW$T$105)
$C$DW$100	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$100, DW_AT_type(*$C$DW$99)
$C$DW$T$106	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$100)
$C$DW$T$107	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$106)
	.dwattr $C$DW$T$107, DW_AT_address_class(0x10)
$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_SysRegsOvly")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$108, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x30)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x4c)
$C$DW$101	.dwtag  DW_TAG_member
	.dwattr $C$DW$101, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$101, DW_AT_name("IER0")
	.dwattr $C$DW$101, DW_AT_TI_symbol_name("_IER0")
	.dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$101, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$101, DW_AT_decl_line(0x19)
	.dwattr $C$DW$101, DW_AT_decl_column(0x15)
$C$DW$102	.dwtag  DW_TAG_member
	.dwattr $C$DW$102, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$102, DW_AT_name("IFR0")
	.dwattr $C$DW$102, DW_AT_TI_symbol_name("_IFR0")
	.dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$102, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$102, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$102, DW_AT_decl_column(0x15)
$C$DW$103	.dwtag  DW_TAG_member
	.dwattr $C$DW$103, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$103, DW_AT_name("ST0_55")
	.dwattr $C$DW$103, DW_AT_TI_symbol_name("_ST0_55")
	.dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$103, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$103, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$103, DW_AT_decl_column(0x15)
$C$DW$104	.dwtag  DW_TAG_member
	.dwattr $C$DW$104, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$104, DW_AT_name("ST1_55")
	.dwattr $C$DW$104, DW_AT_TI_symbol_name("_ST1_55")
	.dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$104, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$104, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$104, DW_AT_decl_column(0x15)
$C$DW$105	.dwtag  DW_TAG_member
	.dwattr $C$DW$105, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$105, DW_AT_name("ST3_55")
	.dwattr $C$DW$105, DW_AT_TI_symbol_name("_ST3_55")
	.dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$105, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$105, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$105, DW_AT_decl_column(0x15)
$C$DW$106	.dwtag  DW_TAG_member
	.dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$106, DW_AT_name("RSVD0")
	.dwattr $C$DW$106, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$106, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$106, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$106, DW_AT_decl_column(0x15)
$C$DW$107	.dwtag  DW_TAG_member
	.dwattr $C$DW$107, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$107, DW_AT_name("IER1")
	.dwattr $C$DW$107, DW_AT_TI_symbol_name("_IER1")
	.dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$107, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$107, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$107, DW_AT_decl_column(0x15)
$C$DW$108	.dwtag  DW_TAG_member
	.dwattr $C$DW$108, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$108, DW_AT_name("IFR1")
	.dwattr $C$DW$108, DW_AT_TI_symbol_name("_IFR1")
	.dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$108, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$108, DW_AT_decl_line(0x20)
	.dwattr $C$DW$108, DW_AT_decl_column(0x15)
$C$DW$109	.dwtag  DW_TAG_member
	.dwattr $C$DW$109, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$109, DW_AT_name("RSVD1")
	.dwattr $C$DW$109, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x47]
	.dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$109, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$109, DW_AT_decl_line(0x21)
	.dwattr $C$DW$109, DW_AT_decl_column(0x15)
$C$DW$110	.dwtag  DW_TAG_member
	.dwattr $C$DW$110, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$110, DW_AT_name("IVPD")
	.dwattr $C$DW$110, DW_AT_TI_symbol_name("_IVPD")
	.dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$110, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$110, DW_AT_decl_line(0x22)
	.dwattr $C$DW$110, DW_AT_decl_column(0x15)
$C$DW$111	.dwtag  DW_TAG_member
	.dwattr $C$DW$111, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$111, DW_AT_name("IVPH")
	.dwattr $C$DW$111, DW_AT_TI_symbol_name("_IVPH")
	.dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$111, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$111, DW_AT_decl_line(0x23)
	.dwattr $C$DW$111, DW_AT_decl_column(0x15)
$C$DW$112	.dwtag  DW_TAG_member
	.dwattr $C$DW$112, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$112, DW_AT_name("ST2_55")
	.dwattr $C$DW$112, DW_AT_TI_symbol_name("_ST2_55")
	.dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4b]
	.dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$112, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$112, DW_AT_decl_line(0x24)
	.dwattr $C$DW$112, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x11)
$C$DW$T$109	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegs")
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$109, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/cslr_cpu.h")
	.dwattr $C$DW$T$109, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$109, DW_AT_decl_column(0x03)
$C$DW$113	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$113, DW_AT_type(*$C$DW$T$109)
$C$DW$T$110	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$113)
$C$DW$T$111	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$110)
	.dwattr $C$DW$T$111, DW_AT_address_class(0x17)
$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_CpuRegsOvly")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$111)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$112, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x2e)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x39)
$C$DW$114	.dwtag  DW_TAG_member
	.dwattr $C$DW$114, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$114, DW_AT_name("ICOAR")
	.dwattr $C$DW$114, DW_AT_TI_symbol_name("_ICOAR")
	.dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$114, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$114, DW_AT_decl_line(0x19)
	.dwattr $C$DW$114, DW_AT_decl_column(0x15)
$C$DW$115	.dwtag  DW_TAG_member
	.dwattr $C$DW$115, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$115, DW_AT_name("RSVD0")
	.dwattr $C$DW$115, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$115, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$115, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$115, DW_AT_decl_column(0x15)
$C$DW$116	.dwtag  DW_TAG_member
	.dwattr $C$DW$116, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$116, DW_AT_name("ICIMR")
	.dwattr $C$DW$116, DW_AT_TI_symbol_name("_ICIMR")
	.dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$116, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$116, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$116, DW_AT_decl_column(0x15)
$C$DW$117	.dwtag  DW_TAG_member
	.dwattr $C$DW$117, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$117, DW_AT_name("RSVD1")
	.dwattr $C$DW$117, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$117, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$117, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$117, DW_AT_decl_column(0x15)
$C$DW$118	.dwtag  DW_TAG_member
	.dwattr $C$DW$118, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$118, DW_AT_name("ICSTR")
	.dwattr $C$DW$118, DW_AT_TI_symbol_name("_ICSTR")
	.dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$118, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$118, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$118, DW_AT_decl_column(0x15)
$C$DW$119	.dwtag  DW_TAG_member
	.dwattr $C$DW$119, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$119, DW_AT_name("RSVD2")
	.dwattr $C$DW$119, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$119, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$119, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$119, DW_AT_decl_column(0x15)
$C$DW$120	.dwtag  DW_TAG_member
	.dwattr $C$DW$120, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$120, DW_AT_name("ICCLKL")
	.dwattr $C$DW$120, DW_AT_TI_symbol_name("_ICCLKL")
	.dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$120, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$120, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$120, DW_AT_decl_column(0x15)
$C$DW$121	.dwtag  DW_TAG_member
	.dwattr $C$DW$121, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$121, DW_AT_name("RSVD3")
	.dwattr $C$DW$121, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$121, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$121, DW_AT_decl_line(0x20)
	.dwattr $C$DW$121, DW_AT_decl_column(0x15)
$C$DW$122	.dwtag  DW_TAG_member
	.dwattr $C$DW$122, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$122, DW_AT_name("ICCLKH")
	.dwattr $C$DW$122, DW_AT_TI_symbol_name("_ICCLKH")
	.dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$122, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$122, DW_AT_decl_line(0x21)
	.dwattr $C$DW$122, DW_AT_decl_column(0x15)
$C$DW$123	.dwtag  DW_TAG_member
	.dwattr $C$DW$123, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$123, DW_AT_name("RSVD4")
	.dwattr $C$DW$123, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$123, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$123, DW_AT_decl_line(0x22)
	.dwattr $C$DW$123, DW_AT_decl_column(0x15)
$C$DW$124	.dwtag  DW_TAG_member
	.dwattr $C$DW$124, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$124, DW_AT_name("ICCNT")
	.dwattr $C$DW$124, DW_AT_TI_symbol_name("_ICCNT")
	.dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$124, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$124, DW_AT_decl_line(0x23)
	.dwattr $C$DW$124, DW_AT_decl_column(0x15)
$C$DW$125	.dwtag  DW_TAG_member
	.dwattr $C$DW$125, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$125, DW_AT_name("RSVD5")
	.dwattr $C$DW$125, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$125, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$125, DW_AT_decl_line(0x24)
	.dwattr $C$DW$125, DW_AT_decl_column(0x15)
$C$DW$126	.dwtag  DW_TAG_member
	.dwattr $C$DW$126, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$126, DW_AT_name("ICDRR")
	.dwattr $C$DW$126, DW_AT_TI_symbol_name("_ICDRR")
	.dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$126, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$126, DW_AT_decl_line(0x25)
	.dwattr $C$DW$126, DW_AT_decl_column(0x15)
$C$DW$127	.dwtag  DW_TAG_member
	.dwattr $C$DW$127, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$127, DW_AT_name("RSVD6")
	.dwattr $C$DW$127, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$127, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$127, DW_AT_decl_line(0x26)
	.dwattr $C$DW$127, DW_AT_decl_column(0x15)
$C$DW$128	.dwtag  DW_TAG_member
	.dwattr $C$DW$128, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$128, DW_AT_name("ICSAR")
	.dwattr $C$DW$128, DW_AT_TI_symbol_name("_ICSAR")
	.dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$128, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$128, DW_AT_decl_line(0x27)
	.dwattr $C$DW$128, DW_AT_decl_column(0x15)
$C$DW$129	.dwtag  DW_TAG_member
	.dwattr $C$DW$129, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$129, DW_AT_name("RSVD7")
	.dwattr $C$DW$129, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$129, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$129, DW_AT_decl_line(0x28)
	.dwattr $C$DW$129, DW_AT_decl_column(0x15)
$C$DW$130	.dwtag  DW_TAG_member
	.dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$130, DW_AT_name("ICDXR")
	.dwattr $C$DW$130, DW_AT_TI_symbol_name("_ICDXR")
	.dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$130, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$130, DW_AT_decl_line(0x29)
	.dwattr $C$DW$130, DW_AT_decl_column(0x15)
$C$DW$131	.dwtag  DW_TAG_member
	.dwattr $C$DW$131, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$131, DW_AT_name("RSVD8")
	.dwattr $C$DW$131, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$131, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$131, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$131, DW_AT_decl_column(0x15)
$C$DW$132	.dwtag  DW_TAG_member
	.dwattr $C$DW$132, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$132, DW_AT_name("ICMDR")
	.dwattr $C$DW$132, DW_AT_TI_symbol_name("_ICMDR")
	.dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$132, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$132, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$132, DW_AT_decl_column(0x15)
$C$DW$133	.dwtag  DW_TAG_member
	.dwattr $C$DW$133, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$133, DW_AT_name("RSVD9")
	.dwattr $C$DW$133, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
	.dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$133, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$133, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$133, DW_AT_decl_column(0x15)
$C$DW$134	.dwtag  DW_TAG_member
	.dwattr $C$DW$134, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$134, DW_AT_name("ICIVR")
	.dwattr $C$DW$134, DW_AT_TI_symbol_name("_ICIVR")
	.dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$134, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$134, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$134, DW_AT_decl_column(0x15)
$C$DW$135	.dwtag  DW_TAG_member
	.dwattr $C$DW$135, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$135, DW_AT_name("RSVD10")
	.dwattr $C$DW$135, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$135, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$135, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$135, DW_AT_decl_column(0x15)
$C$DW$136	.dwtag  DW_TAG_member
	.dwattr $C$DW$136, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$136, DW_AT_name("ICEMDR")
	.dwattr $C$DW$136, DW_AT_TI_symbol_name("_ICEMDR")
	.dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$136, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$136, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$136, DW_AT_decl_column(0x15)
$C$DW$137	.dwtag  DW_TAG_member
	.dwattr $C$DW$137, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$137, DW_AT_name("RSVD11")
	.dwattr $C$DW$137, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$137, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$137, DW_AT_decl_line(0x30)
	.dwattr $C$DW$137, DW_AT_decl_column(0x15)
$C$DW$138	.dwtag  DW_TAG_member
	.dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$138, DW_AT_name("ICPSC")
	.dwattr $C$DW$138, DW_AT_TI_symbol_name("_ICPSC")
	.dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$138, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$138, DW_AT_decl_line(0x31)
	.dwattr $C$DW$138, DW_AT_decl_column(0x15)
$C$DW$139	.dwtag  DW_TAG_member
	.dwattr $C$DW$139, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$139, DW_AT_name("RSVD12")
	.dwattr $C$DW$139, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
	.dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$139, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$139, DW_AT_decl_line(0x32)
	.dwattr $C$DW$139, DW_AT_decl_column(0x15)
$C$DW$140	.dwtag  DW_TAG_member
	.dwattr $C$DW$140, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$140, DW_AT_name("ICPID1")
	.dwattr $C$DW$140, DW_AT_TI_symbol_name("_ICPID1")
	.dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$140, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$140, DW_AT_decl_line(0x33)
	.dwattr $C$DW$140, DW_AT_decl_column(0x15)
$C$DW$141	.dwtag  DW_TAG_member
	.dwattr $C$DW$141, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$141, DW_AT_name("RSVD13")
	.dwattr $C$DW$141, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$141, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$141, DW_AT_decl_line(0x34)
	.dwattr $C$DW$141, DW_AT_decl_column(0x15)
$C$DW$142	.dwtag  DW_TAG_member
	.dwattr $C$DW$142, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$142, DW_AT_name("ICPID2")
	.dwattr $C$DW$142, DW_AT_TI_symbol_name("_ICPID2")
	.dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$142, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$142, DW_AT_decl_line(0x35)
	.dwattr $C$DW$142, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x11)
$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegs")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$113, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2c.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x03)
$C$DW$143	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$143, DW_AT_type(*$C$DW$T$113)
$C$DW$144	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$144, DW_AT_type(*$C$DW$143)
$C$DW$T$114	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$144)
$C$DW$T$115	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$114)
	.dwattr $C$DW$T$115, DW_AT_address_class(0x10)
$C$DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2cRegsOvly")
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$115)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$116, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$116, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$116, DW_AT_decl_column(0x2f)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x2e)
$C$DW$145	.dwtag  DW_TAG_member
	.dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$145, DW_AT_name("I2SSCTRL")
	.dwattr $C$DW$145, DW_AT_TI_symbol_name("_I2SSCTRL")
	.dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$145, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$145, DW_AT_decl_line(0x19)
	.dwattr $C$DW$145, DW_AT_decl_column(0x15)
$C$DW$146	.dwtag  DW_TAG_member
	.dwattr $C$DW$146, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$146, DW_AT_name("RSVD0")
	.dwattr $C$DW$146, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$146, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$146, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$146, DW_AT_decl_column(0x15)
$C$DW$147	.dwtag  DW_TAG_member
	.dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$147, DW_AT_name("I2SSRATE")
	.dwattr $C$DW$147, DW_AT_TI_symbol_name("_I2SSRATE")
	.dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$147, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$147, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$147, DW_AT_decl_column(0x15)
$C$DW$148	.dwtag  DW_TAG_member
	.dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$148, DW_AT_name("RSVD1")
	.dwattr $C$DW$148, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$148, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$148, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$148, DW_AT_decl_column(0x15)
$C$DW$149	.dwtag  DW_TAG_member
	.dwattr $C$DW$149, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$149, DW_AT_name("I2STXLT0")
	.dwattr $C$DW$149, DW_AT_TI_symbol_name("_I2STXLT0")
	.dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$149, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$149, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$149, DW_AT_decl_column(0x15)
$C$DW$150	.dwtag  DW_TAG_member
	.dwattr $C$DW$150, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$150, DW_AT_name("I2STXLT1")
	.dwattr $C$DW$150, DW_AT_TI_symbol_name("_I2STXLT1")
	.dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$150, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$150, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$150, DW_AT_decl_column(0x15)
$C$DW$151	.dwtag  DW_TAG_member
	.dwattr $C$DW$151, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$151, DW_AT_name("RSVD2")
	.dwattr $C$DW$151, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$151, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$151, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$151, DW_AT_decl_column(0x15)
$C$DW$152	.dwtag  DW_TAG_member
	.dwattr $C$DW$152, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$152, DW_AT_name("I2STXRT0")
	.dwattr $C$DW$152, DW_AT_TI_symbol_name("_I2STXRT0")
	.dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$152, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$152, DW_AT_decl_line(0x20)
	.dwattr $C$DW$152, DW_AT_decl_column(0x15)
$C$DW$153	.dwtag  DW_TAG_member
	.dwattr $C$DW$153, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$153, DW_AT_name("I2STXRT1")
	.dwattr $C$DW$153, DW_AT_TI_symbol_name("_I2STXRT1")
	.dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$153, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$153, DW_AT_decl_line(0x21)
	.dwattr $C$DW$153, DW_AT_decl_column(0x15)
$C$DW$154	.dwtag  DW_TAG_member
	.dwattr $C$DW$154, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$154, DW_AT_name("RSVD3")
	.dwattr $C$DW$154, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$154, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$154, DW_AT_decl_line(0x22)
	.dwattr $C$DW$154, DW_AT_decl_column(0x15)
$C$DW$155	.dwtag  DW_TAG_member
	.dwattr $C$DW$155, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$155, DW_AT_name("I2SINTFL")
	.dwattr $C$DW$155, DW_AT_TI_symbol_name("_I2SINTFL")
	.dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$155, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$155, DW_AT_decl_line(0x23)
	.dwattr $C$DW$155, DW_AT_decl_column(0x15)
$C$DW$156	.dwtag  DW_TAG_member
	.dwattr $C$DW$156, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$156, DW_AT_name("RSVD4")
	.dwattr $C$DW$156, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$156, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$156, DW_AT_decl_line(0x24)
	.dwattr $C$DW$156, DW_AT_decl_column(0x15)
$C$DW$157	.dwtag  DW_TAG_member
	.dwattr $C$DW$157, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$157, DW_AT_name("I2SINTMASK")
	.dwattr $C$DW$157, DW_AT_TI_symbol_name("_I2SINTMASK")
	.dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$157, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$157, DW_AT_decl_line(0x25)
	.dwattr $C$DW$157, DW_AT_decl_column(0x15)
$C$DW$158	.dwtag  DW_TAG_member
	.dwattr $C$DW$158, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$158, DW_AT_name("RSVD5")
	.dwattr $C$DW$158, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$158, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$158, DW_AT_decl_line(0x26)
	.dwattr $C$DW$158, DW_AT_decl_column(0x15)
$C$DW$159	.dwtag  DW_TAG_member
	.dwattr $C$DW$159, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$159, DW_AT_name("I2SRXLT0")
	.dwattr $C$DW$159, DW_AT_TI_symbol_name("_I2SRXLT0")
	.dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$159, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$159, DW_AT_decl_line(0x27)
	.dwattr $C$DW$159, DW_AT_decl_column(0x15)
$C$DW$160	.dwtag  DW_TAG_member
	.dwattr $C$DW$160, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$160, DW_AT_name("I2SRXLT1")
	.dwattr $C$DW$160, DW_AT_TI_symbol_name("_I2SRXLT1")
	.dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$160, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$160, DW_AT_decl_line(0x28)
	.dwattr $C$DW$160, DW_AT_decl_column(0x15)
$C$DW$161	.dwtag  DW_TAG_member
	.dwattr $C$DW$161, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$161, DW_AT_name("RSVD6")
	.dwattr $C$DW$161, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$161, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$161, DW_AT_decl_line(0x29)
	.dwattr $C$DW$161, DW_AT_decl_column(0x15)
$C$DW$162	.dwtag  DW_TAG_member
	.dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$162, DW_AT_name("I2SRXRT0")
	.dwattr $C$DW$162, DW_AT_TI_symbol_name("_I2SRXRT0")
	.dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$162, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$162, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$162, DW_AT_decl_column(0x15)
$C$DW$163	.dwtag  DW_TAG_member
	.dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$163, DW_AT_name("I2SRXRT1")
	.dwattr $C$DW$163, DW_AT_TI_symbol_name("_I2SRXRT1")
	.dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2d]
	.dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$163, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$163, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$163, DW_AT_decl_column(0x15)
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x18)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x11)
$C$DW$T$117	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegs")
	.dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$117, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_i2s.h")
	.dwattr $C$DW$T$117, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$117, DW_AT_decl_column(0x03)
$C$DW$164	.dwtag  DW_TAG_TI_far_type
	.dwattr $C$DW$164, DW_AT_type(*$C$DW$T$117)
$C$DW$165	.dwtag  DW_TAG_TI_ioport_type
	.dwattr $C$DW$165, DW_AT_type(*$C$DW$164)
$C$DW$T$118	.dwtag  DW_TAG_volatile_type
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$165)
$C$DW$T$119	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
	.dwattr $C$DW$T$119, DW_AT_address_class(0x10)
$C$DW$T$120	.dwtag  DW_TAG_typedef, DW_AT_name("CSL_I2sRegsOvly")
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$120, DW_AT_decl_file("C:/Users/Sean/Documents/GitHub/NoiseNinjas/code/ezdsp5535_v1/tests/aic3204/../../c55xx_csl/inc/soc.h")
	.dwattr $C$DW$T$120, DW_AT_decl_line(0x50)
	.dwattr $C$DW$T$120, DW_AT_decl_column(0x31)

$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0xde)
$C$DW$166	.dwtag  DW_TAG_member
	.dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$166, DW_AT_name("REV")
	.dwattr $C$DW$166, DW_AT_TI_symbol_name("_REV")
	.dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$166, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$166, DW_AT_decl_line(0x19)
	.dwattr $C$DW$166, DW_AT_decl_column(0x15)
$C$DW$167	.dwtag  DW_TAG_member
	.dwattr $C$DW$167, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$167, DW_AT_name("STATUS")
	.dwattr $C$DW$167, DW_AT_TI_symbol_name("_STATUS")
	.dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$167, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$167, DW_AT_decl_line(0x1a)
	.dwattr $C$DW$167, DW_AT_decl_column(0x15)
$C$DW$168	.dwtag  DW_TAG_member
	.dwattr $C$DW$168, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$168, DW_AT_name("RSVD0")
	.dwattr $C$DW$168, DW_AT_TI_symbol_name("_RSVD0")
	.dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$168, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$168, DW_AT_decl_line(0x1b)
	.dwattr $C$DW$168, DW_AT_decl_column(0x15)
$C$DW$169	.dwtag  DW_TAG_member
	.dwattr $C$DW$169, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$169, DW_AT_name("AWCCR1")
	.dwattr $C$DW$169, DW_AT_TI_symbol_name("_AWCCR1")
	.dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$169, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$169, DW_AT_decl_line(0x1c)
	.dwattr $C$DW$169, DW_AT_decl_column(0x15)
$C$DW$170	.dwtag  DW_TAG_member
	.dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$170, DW_AT_name("AWCCR2")
	.dwattr $C$DW$170, DW_AT_TI_symbol_name("_AWCCR2")
	.dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$170, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$170, DW_AT_decl_line(0x1d)
	.dwattr $C$DW$170, DW_AT_decl_column(0x15)
$C$DW$171	.dwtag  DW_TAG_member
	.dwattr $C$DW$171, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$171, DW_AT_name("RSVD1")
	.dwattr $C$DW$171, DW_AT_TI_symbol_name("_RSVD1")
	.dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$171, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$171, DW_AT_decl_line(0x1e)
	.dwattr $C$DW$171, DW_AT_decl_column(0x15)
$C$DW$172	.dwtag  DW_TAG_member
	.dwattr $C$DW$172, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$172, DW_AT_name("SDCR1")
	.dwattr $C$DW$172, DW_AT_TI_symbol_name("_SDCR1")
	.dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$172, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$172, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$172, DW_AT_decl_column(0x15)
$C$DW$173	.dwtag  DW_TAG_member
	.dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$173, DW_AT_name("SDCR2")
	.dwattr $C$DW$173, DW_AT_TI_symbol_name("_SDCR2")
	.dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$173, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$173, DW_AT_decl_line(0x20)
	.dwattr $C$DW$173, DW_AT_decl_column(0x15)
$C$DW$174	.dwtag  DW_TAG_member
	.dwattr $C$DW$174, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$174, DW_AT_name("RSVD2")
	.dwattr $C$DW$174, DW_AT_TI_symbol_name("_RSVD2")
	.dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$174, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$174, DW_AT_decl_line(0x21)
	.dwattr $C$DW$174, DW_AT_decl_column(0x15)
$C$DW$175	.dwtag  DW_TAG_member
	.dwattr $C$DW$175, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$175, DW_AT_name("SDRCR")
	.dwattr $C$DW$175, DW_AT_TI_symbol_name("_SDRCR")
	.dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$175, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$175, DW_AT_decl_line(0x22)
	.dwattr $C$DW$175, DW_AT_decl_column(0x15)
$C$DW$176	.dwtag  DW_TAG_member
	.dwattr $C$DW$176, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$176, DW_AT_name("RSVD3")
	.dwattr $C$DW$176, DW_AT_TI_symbol_name("_RSVD3")
	.dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$176, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$176, DW_AT_decl_line(0x23)
	.dwattr $C$DW$176, DW_AT_decl_column(0x15)
$C$DW$177	.dwtag  DW_TAG_member
	.dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$177, DW_AT_name("ACS2CR1")
	.dwattr $C$DW$177, DW_AT_TI_symbol_name("_ACS2CR1")
	.dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$177, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$177, DW_AT_decl_line(0x24)
	.dwattr $C$DW$177, DW_AT_decl_column(0x15)
$C$DW$178	.dwtag  DW_TAG_member
	.dwattr $C$DW$178, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$178, DW_AT_name("ACS2CR2")
	.dwattr $C$DW$178, DW_AT_TI_symbol_name("_ACS2CR2")
	.dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
	.dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$178, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$178, DW_AT_decl_line(0x25)
	.dwattr $C$DW$178, DW_AT_decl_column(0x15)
$C$DW$179	.dwtag  DW_TAG_member
	.dwattr $C$DW$179, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$179, DW_AT_name("RSVD4")
	.dwattr $C$DW$179, DW_AT_TI_symbol_name("_RSVD4")
	.dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$179, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$179, DW_AT_decl_line(0x26)
	.dwattr $C$DW$179, DW_AT_decl_column(0x15)
$C$DW$180	.dwtag  DW_TAG_member
	.dwattr $C$DW$180, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$180, DW_AT_name("ACS3CR1")
	.dwattr $C$DW$180, DW_AT_TI_symbol_name("_ACS3CR1")
	.dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$180, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$180, DW_AT_decl_line(0x27)
	.dwattr $C$DW$180, DW_AT_decl_column(0x15)
$C$DW$181	.dwtag  DW_TAG_member
	.dwattr $C$DW$181, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$181, DW_AT_name("ACS3CR2")
	.dwattr $C$DW$181, DW_AT_TI_symbol_name("_ACS3CR2")
	.dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$181, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$181, DW_AT_decl_line(0x28)
	.dwattr $C$DW$181, DW_AT_decl_column(0x15)
$C$DW$182	.dwtag  DW_TAG_member
	.dwattr $C$DW$182, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$182, DW_AT_name("RSVD5")
	.dwattr $C$DW$182, DW_AT_TI_symbol_name("_RSVD5")
	.dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$182, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$182, DW_AT_decl_line(0x29)
	.dwattr $C$DW$182, DW_AT_decl_column(0x15)
$C$DW$183	.dwtag  DW_TAG_member
	.dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$183, DW_AT_name("ACS4CR1")
	.dwattr $C$DW$183, DW_AT_TI_symbol_name("_ACS4CR1")
	.dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$183, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$183, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$183, DW_AT_decl_column(0x15)
$C$DW$184	.dwtag  DW_TAG_member
	.dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$184, DW_AT_name("ACS4CR2")
	.dwattr $C$DW$184, DW_AT_TI_symbol_name("_ACS4CR2")
	.dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$184, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$184, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$184, DW_AT_decl_column(0x15)
$C$DW$185	.dwtag  DW_TAG_member
	.dwattr $C$DW$185, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$185, DW_AT_name("RSVD6")
	.dwattr $C$DW$185, DW_AT_TI_symbol_name("_RSVD6")
	.dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$185, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$185, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$185, DW_AT_decl_column(0x15)
$C$DW$186	.dwtag  DW_TAG_member
	.dwattr $C$DW$186, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$186, DW_AT_name("ACS5CR1")
	.dwattr $C$DW$186, DW_AT_TI_symbol_name("_ACS5CR1")
	.dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$186, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$186, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$186, DW_AT_decl_column(0x15)
$C$DW$187	.dwtag  DW_TAG_member
	.dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$187, DW_AT_name("ACS5CR2")
	.dwattr $C$DW$187, DW_AT_TI_symbol_name("_ACS5CR2")
	.dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
	.dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$187, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$187, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$187, DW_AT_decl_column(0x15)
$C$DW$188	.dwtag  DW_TAG_member
	.dwattr $C$DW$188, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$188, DW_AT_name("RSVD7")
	.dwattr $C$DW$188, DW_AT_TI_symbol_name("_RSVD7")
	.dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
	.dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$188, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$188, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$188, DW_AT_decl_column(0x15)
$C$DW$189	.dwtag  DW_TAG_member
	.dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$189, DW_AT_name("SDTIMR1")
	.dwattr $C$DW$189, DW_AT_TI_symbol_name("_SDTIMR1")
	.dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$189, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$189, DW_AT_decl_line(0x30)
	.dwattr $C$DW$189, DW_AT_decl_column(0x15)
$C$DW$190	.dwtag  DW_TAG_member
	.dwattr $C$DW$190, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$190, DW_AT_name("RSVD8")
	.dwattr $C$DW$190, DW_AT_TI_symbol_name("_RSVD8")
	.dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$190, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$190, DW_AT_decl_line(0x31)
	.dwattr $C$DW$190, DW_AT_decl_column(0x15)
$C$DW$191	.dwtag  DW_TAG_member
	.dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$191, DW_AT_name("SDSRETR")
	.dwattr $C$DW$191, DW_AT_TI_symbol_name("_SDSRETR")
	.dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$191, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$191, DW_AT_decl_line(0x32)
	.dwattr $C$DW$191, DW_AT_decl_column(0x15)
$C$DW$192	.dwtag  DW_TAG_member
	.dwattr $C$DW$192, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$192, DW_AT_name("RSVD9")
	.dwattr $C$DW$192, DW_AT_TI_symbol_name("_RSVD9")
	.dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$192, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$192, DW_AT_decl_line(0x33)
	.dwattr $C$DW$192, DW_AT_decl_column(0x15)
$C$DW$193	.dwtag  DW_TAG_member
	.dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$193, DW_AT_name("EIRR")
	.dwattr $C$DW$193, DW_AT_TI_symbol_name("_EIRR")
	.dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$193, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$193, DW_AT_decl_line(0x34)
	.dwattr $C$DW$193, DW_AT_decl_column(0x15)
$C$DW$194	.dwtag  DW_TAG_member
	.dwattr $C$DW$194, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$194, DW_AT_name("RSVD10")
	.dwattr $C$DW$194, DW_AT_TI_symbol_name("_RSVD10")
	.dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x41]
	.dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$194, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$194, DW_AT_decl_line(0x35)
	.dwattr $C$DW$194, DW_AT_decl_column(0x15)
$C$DW$195	.dwtag  DW_TAG_member
	.dwattr $C$DW$195, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$195, DW_AT_name("EIMR")
	.dwattr $C$DW$195, DW_AT_TI_symbol_name("_EIMR")
	.dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$195, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$195, DW_AT_decl_line(0x36)
	.dwattr $C$DW$195, DW_AT_decl_column(0x15)
$C$DW$196	.dwtag  DW_TAG_member
	.dwattr $C$DW$196, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$196, DW_AT_name("RSVD11")
	.dwattr $C$DW$196, DW_AT_TI_symbol_name("_RSVD11")
	.dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x45]
	.dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$196, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$196, DW_AT_decl_line(0x37)
	.dwattr $C$DW$196, DW_AT_decl_column(0x15)
$C$DW$197	.dwtag  DW_TAG_member
	.dwattr $C$DW$197, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$197, DW_AT_name("EIMSR")
	.dwattr $C$DW$197, DW_AT_TI_symbol_name("_EIMSR")
	.dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$197, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$197, DW_AT_decl_line(0x38)
	.dwattr $C$DW$197, DW_AT_decl_column(0x15)
$C$DW$198	.dwtag  DW_TAG_member
	.dwattr $C$DW$198, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$198, DW_AT_name("RSVD12")
	.dwattr $C$DW$198, DW_AT_TI_symbol_name("_RSVD12")
	.dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$198, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$198, DW_AT_decl_line(0x39)
	.dwattr $C$DW$198, DW_AT_decl_column(0x15)
$C$DW$199	.dwtag  DW_TAG_member
	.dwattr $C$DW$199, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$199, DW_AT_name("EIMCR")
	.dwattr $C$DW$199, DW_AT_TI_symbol_name("_EIMCR")
	.dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$199, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$199, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$199, DW_AT_decl_column(0x15)
$C$DW$200	.dwtag  DW_TAG_member
	.dwattr $C$DW$200, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$200, DW_AT_name("RSVD13")
	.dwattr $C$DW$200, DW_AT_TI_symbol_name("_RSVD13")
	.dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x4d]
	.dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$200, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$200, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$200, DW_AT_decl_column(0x15)
$C$DW$201	.dwtag  DW_TAG_member
	.dwattr $C$DW$201, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$201, DW_AT_name("NANDFCR")
	.dwattr $C$DW$201, DW_AT_TI_symbol_name("_NANDFCR")
	.dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$201, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$201, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$201, DW_AT_decl_column(0x15)
$C$DW$202	.dwtag  DW_TAG_member
	.dwattr $C$DW$202, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$202, DW_AT_name("RSVD14")
	.dwattr $C$DW$202, DW_AT_TI_symbol_name("_RSVD14")
	.dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x61]
	.dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$202, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$202, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$202, DW_AT_decl_column(0x15)
$C$DW$203	.dwtag  DW_TAG_member
	.dwattr $C$DW$203, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$203, DW_AT_name("NANDFSR1")
	.dwattr $C$DW$203, DW_AT_TI_symbol_name("_NANDFSR1")
	.dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$203, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$203, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$203, DW_AT_decl_column(0x15)
$C$DW$204	.dwtag  DW_TAG_member
	.dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$204, DW_AT_name("NANDFSR2")
	.dwattr $C$DW$204, DW_AT_TI_symbol_name("_NANDFSR2")
	.dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x65]
	.dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$204, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$204, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$204, DW_AT_decl_column(0x15)
$C$DW$205	.dwtag  DW_TAG_member
	.dwattr $C$DW$205, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$205, DW_AT_name("RSVD15")
	.dwattr $C$DW$205, DW_AT_TI_symbol_name("_RSVD15")
	.dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$205, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$205, DW_AT_decl_line(0x40)
	.dwattr $C$DW$205, DW_AT_decl_column(0x15)
$C$DW$206	.dwtag  DW_TAG_member
	.dwattr $C$DW$206, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$206, DW_AT_name("PAGEMODCTRL1")
	.dwattr $C$DW$206, DW_AT_TI_symbol_name("_PAGEMODCTRL1")
	.dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$206, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$206, DW_AT_decl_line(0x41)
	.dwattr $C$DW$206, DW_AT_decl_column(0x15)
$C$DW$207	.dwtag  DW_TAG_member
	.dwattr $C$DW$207, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$207, DW_AT_name("PAGEMODCTRL2")
	.dwattr $C$DW$207, DW_AT_TI_symbol_name("_PAGEMODCTRL2")
	.dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x69]
	.dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$207, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$207, DW_AT_decl_line(0x42)
	.dwattr $C$DW$207, DW_AT_decl_column(0x15)
$C$DW$208	.dwtag  DW_TAG_member
	.dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$208, DW_AT_name("RSVD16")
	.dwattr $C$DW$208, DW_AT_TI_symbol_name("_RSVD16")
	.dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$208, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$208, DW_AT_decl_line(0x43)
	.dwattr $C$DW$208, DW_AT_decl_column(0x15)
$C$DW$209	.dwtag  DW_TAG_member
	.dwattr $C$DW$209, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$209, DW_AT_name("NCS2ECC1")
	.dwattr $C$DW$209, DW_AT_TI_symbol_name("_NCS2ECC1")
	.dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$209, DW_AT_decl_file("C:\Users\Sean\Documents\GitHub\NoiseNinjas\code\ezdsp5535_v1\tests\aic3204\..\..\c55xx_csl\inc\cslr_emif.h")
	.dwattr $C$DW$209, DW_AT_decl_line(0x44)
	.dwattr $C$DW$209, DW_AT_decl_column(0x15)
$C$DW$210	.dwtag  DW_TAG_member
	.dwattr $C$DW$210, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$210, DW_AT_name("NCS2ECC2")
	.dwattr $C$DW$210, DW_AT_TI_symbol_name("_NCS2ECC2")
